
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       7 |          6 |           9 |
## Affected resources by action

|  Action  | Resources                                                                 |
|:--------:|:--------------------------------------------------------------------------|
|    🟢     | `module.website.aws_route53_record.apex[0]`                               |
|    🟡     | `module.website.aws_lb_listener.ssl`                                      |
|    🟡     | `module.website-vpc.aws_subnet.all["10.0.4.0/24"]`                        |
|    🟡     | `module.website-vpc.aws_subnet.all["10.0.5.0/24"]`                        |
|    🟡     | `module.website-vpc.aws_subnet.all["10.0.6.0/24"]`                        |
|    🟡     | `module.website-vpc.aws_subnet.all["10.0.7.0/24"]`                        |
|    🟡     | `module.website-vpc.aws_vpc.vpc`                                          |
|    🔴     | `module.website.aws_route53_record.cert_validation["www.infrahouse.com"]` |
|    🔴     | `module.website.aws_route53_record.extra[0]`                              |
|    🔴     | `module.website.aws_route53_record.primary`                               |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/522a92b1-e391-467f-aa4f-707e9b872921/terraform-bin plan -no-color --out=tf.plan
module.cdn.aws_acm_certificate.cdn: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/a09201ea-e83d-43ab-8abd-75004b7d5aa5]
data.aws_iam_policy_document.webserver_permissions: Reading...
data.aws_iam_policy_document.webserver_permissions: Read complete after 0s [id=2218315402]
module.website.data.aws_caller_identity.current: Reading...
module.website.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...
data.aws_availability_zones.uw1: Reading...
module.cdn.data.aws_route53_zone.ih_com: Reading...
data.aws_ami.ubuntu_22: Reading...
module.website.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/webserver20230818170808801500000002]
module.website.aws_route53_record.primary: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_A]
data.aws_route53_zone.infrahouse_com: Reading...
module.website-vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0ae798f941be45345]
module.website.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]
data.aws_key_pair.aleks: Reading...
module.cdn.aws_cloudfront_cache_policy.default: Refreshing state... [id=ea742fff-3eb3-4437-bfce-2ef431afcfcc]
module.website.data.aws_caller_identity.current: Read complete after 1s [id=493370826424]
module.webserver_userdata.data.aws_region.current: Reading...
module.webserver_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.website-vpc.data.aws_vpc.management_vpc[0]: Reading...
module.website.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=webserver20230818170808794200000001]
module.webserver_userdata.data.cloudinit_config.config: Reading...
module.webserver_userdata.data.cloudinit_config.config: Read complete after 0s [id=1339088879]
module.cdn.aws_cloudfront_distribution.repo: Refreshing state... [id=E2S8EXIANFSP8E]
module.website.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=webserver20230818170808794200000001-20230818170809342500000004]
module.website.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=webserver]
data.aws_key_pair.aleks: Read complete after 1s [id=key-01c98b9723b518061]
data.aws_availability_zones.uw1: Read complete after 1s [id=us-west-1]
module.website-vpc.aws_eip.nat_eip["10.0.4.0/24"]: Refreshing state... [id=eipalloc-03ad22a4199a2bfe5]
module.website-vpc.aws_eip.nat_eip["10.0.5.0/24"]: Refreshing state... [id=eipalloc-0beb080e46efeb93f]
data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0ffc0965a705413c8]
module.website.aws_launch_template.website: Refreshing state... [id=lt-0cbf545f2a4d9f53c]
data.aws_route53_zone.infrahouse_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]
module.website.data.aws_route53_zone.webserver_zone: Reading...
module.cdn.data.aws_route53_zone.ih_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]
module.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__a71dbd0ecfc060d317944e3be1dbf59b.cdn.infrahouse.com._CNAME]
module.cdn.aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_cdn.infrahouse.com_A]
module.website-vpc.data.aws_vpc.management_vpc[0]: Read complete after 0s [id=vpc-08e19d859c26d18b2]
module.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Reading...
module.cdn.aws_acm_certificate_validation.repo: Refreshing state... [id=2023-08-21 23:33:58.663 +0000 UTC]
module.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Read complete after 0s [id=us-west-1]
module.website.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]
module.website.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be]
module.website-vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-0feb8f579048fc443]
module.website-vpc.aws_default_route_table.default: Refreshing state... [id=rtb-06b702bdb0cadd810]
module.website-vpc.aws_default_security_group.default: Refreshing state... [id=sg-089f1a85f05cbd32a]
module.website-vpc.aws_route_table.all["10.0.6.0/24"]: Refreshing state... [id=rtb-0decbbf0182384dff]
module.website-vpc.aws_route_table.all["10.0.7.0/24"]: Refreshing state... [id=rtb-0f0d4ab6650ed47a4]
module.website-vpc.aws_route_table.all["10.0.4.0/24"]: Refreshing state... [id=rtb-02ae9fc349324835b]
module.website-vpc.aws_route_table.all["10.0.5.0/24"]: Refreshing state... [id=rtb-0fc65675e5ce07bbf]
module.website-vpc.aws_subnet.all["10.0.7.0/24"]: Refreshing state... [id=subnet-06f352185ffc3fcd3]
module.website-vpc.aws_subnet.all["10.0.4.0/24"]: Refreshing state... [id=subnet-086ccf1b7842243d2]
module.website-vpc.aws_subnet.all["10.0.5.0/24"]: Refreshing state... [id=subnet-05fa33164c768ab65]
module.website-vpc.aws_vpc_peering_connection.link_to_management[0]: Refreshing state... [id=pcx-0fd00008e9a890b35]
module.website-vpc.aws_subnet.all["10.0.6.0/24"]: Refreshing state... [id=subnet-01306fa9e14f9c980]
module.website-vpc.aws_route.default_main: Refreshing state... [id=r-rtb-06b702bdb0cadd8101080289494]
module.website-vpc.aws_route.subnet_public["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b1080289494]
module.website-vpc.aws_route.subnet_public["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf1080289494]
module.website-vpc.aws_nat_gateway.nat_gw["10.0.4.0/24"]: Refreshing state... [id=nat-0a1c16012747ef5e4]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.7.0/24"]: Refreshing state... [id=rtbassoc-0da0fea7d999fcf5f]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.5.0/24"]: Refreshing state... [id=rtbassoc-0716045ba5eb092f0]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.6.0/24"]: Refreshing state... [id=rtbassoc-0c1a3e4c874333baf]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-04d711a4b92896be2]
module.website-vpc.aws_nat_gateway.nat_gw["10.0.5.0/24"]: Refreshing state... [id=nat-00ac19ae43562352f]
module.website-vpc.aws_route.route_from_mgmt_to_me[0]: Refreshing state... [id=r-rtb-0d73383afeb6ad1423177957334]
module.website-vpc.aws_route.route_from_mgmt_to_me[1]: Refreshing state... [id=r-rtb-04a16e74d5b12a3383177957334]
module.website-vpc.aws_route.route_from_mgmt_to_me[2]: Refreshing state... [id=r-rtb-067c30e65dd4108e93177957334]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a4653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b653952448]
module.website.data.aws_subnet.selected: Reading...
module.website.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055]
module.website.aws_route53_record.cert_validation["www.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com._CNAME]
module.website.aws_route53_record.cert_validation["infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME]
module.website-vpc.aws_route.subnet_private["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff1080289494]
module.website-vpc.aws_route.subnet_private["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a41080289494]
module.website.data.aws_subnet.selected: Read complete after 0s [id=subnet-086ccf1b7842243d2]
module.website.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af]
module.website.aws_acm_certificate_validation.website: Refreshing state... [id=2023-08-18 17:08:33.177 +0000 UTC]
module.website.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_www_A]
module.website.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/3d984bc9f1cc3a7d]
module.website.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70]
module.website.aws_autoscaling_group.website: Refreshing state... [id=web-2023081817082248860000000b]
module.website.aws_autoscaling_policy.cpu_load: Refreshing state... [id=web-2023081817082248860000000b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.website.data.aws_network_interface.alb[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_network_interface" "alb" {
      + arn               = (known after apply)
      + association       = (known after apply)
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + interface_type    = (known after apply)
      + ipv6_addresses    = (known after apply)
      + mac_address       = (known after apply)
      + outpost_arn       = (known after apply)
      + owner_id          = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = (known after apply)
      + requester_id      = (known after apply)
      + security_groups   = (known after apply)
      + subnet_id         = (known after apply)
      + tags              = (known after apply)
      + vpc_id            = (known after apply)

      + filter {
          + name   = "description"
          + values = [
              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + "subnet-086ccf1b7842243d2",
            ]
        }
    }

  # module.website.data.aws_network_interface.alb[1] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_network_interface" "alb" {
      + arn               = (known after apply)
      + association       = (known after apply)
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + interface_type    = (known after apply)
      + ipv6_addresses    = (known after apply)
      + mac_address       = (known after apply)
      + outpost_arn       = (known after apply)
      + owner_id          = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = (known after apply)
      + requester_id      = (known after apply)
      + security_groups   = (known after apply)
      + subnet_id         = (known after apply)
      + tags              = (known after apply)
      + vpc_id            = (known after apply)

      + filter {
          + name   = "description"
          + values = [
              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + "subnet-05fa33164c768ab65",
            ]
        }
    }

  # module.website.aws_acm_certificate.website must be replaced
-/+ resource "aws_acm_certificate" "website" {
      ~ arn                       = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "infrahouse.com"
              - resource_record_name  = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws."
            },
          - {
              - domain_name           = "www.infrahouse.com"
              - resource_record_name  = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_a709458fbe45b7dc599cdc357f4d81b8.shzbfwcggp.acm-validations.aws."
            },
          + {
              + domain_name           = "infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-09-15T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-08-18T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "www.infrahouse.com",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (3 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.website.aws_acm_certificate_validation.website must be replaced
-/+ resource "aws_acm_certificate_validation" "website" {
      ~ certificate_arn         = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "2023-08-18 17:08:33.177 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com",
          - "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com",
        ] -> (known after apply) # forces replacement
    }

  # module.website.aws_autoscaling_group.website must be replaced
+/- resource "aws_autoscaling_group" "website" {
      ~ arn                              = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:5b642f2f-b929-4d99-8f78-76e975e92d5f:autoScalingGroupName/web-2023081817082248860000000b" -> (known after apply)
      ~ availability_zones               = [
          - "us-west-1a",
          - "us-west-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 2 -> (known after apply)
      - enabled_metrics                  = [] -> null
      ~ id                               = "web-2023081817082248860000000b" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      ~ name                             = "web-2023081817082248860000000b" -> (known after apply)
      ~ name_prefix                      = "web-" -> "web" # forces replacement
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::493370826424:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (14 unchanged attributes hidden)

      + instance_refresh {
          + strategy = "Rolling"
          + triggers = [
              + "tag",
            ]

          + preferences {
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      ~ launch_template {
          ~ id      = "lt-0cbf545f2a4d9f53c" -> (known after apply)
          ~ name    = "web-20230818170809680400000005" -> (known after apply)
          ~ version = "1" -> (known after apply)
        }

      - traffic_source {
          - identifier = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af" -> null
          - type       = "elbv2" -> null
        }

        # (5 unchanged blocks hidden)
    }

  # module.website.aws_autoscaling_policy.cpu_load must be replaced
-/+ resource "aws_autoscaling_policy" "cpu_load" {
      ~ arn                       = "arn:aws:autoscaling:us-west-1:493370826424:scalingPolicy:df2758a5-be4e-4cd0-8bc4-3612570e6954:autoScalingGroupName/web-2023081817082248860000000b:policyName/web-2023081817082248860000000b" -> (known after apply)
      ~ autoscaling_group_name    = "web-2023081817082248860000000b" # forces replacement -> (known after apply) # forces replacement
      - cooldown                  = 0 -> null
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "web-2023081817082248860000000b" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
      - min_adjustment_magnitude  = 0 -> null
      ~ name                      = "web-2023081817082248860000000b" # forces replacement -> (known after apply) # forces replacement
      - scaling_adjustment        = 0 -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.aws_launch_template.website must be replaced
+/- resource "aws_launch_template" "website" {
      ~ arn                     = "arn:aws:ec2:us-west-1:493370826424:launch-template/lt-0cbf545f2a4d9f53c" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-0cbf545f2a4d9f53c" -> (known after apply)
      ~ image_id                = "ami-01973462ceff35e85" -> "ami-0ffc0965a705413c8"
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "web-20230818170809680400000005" -> (known after apply)
      ~ name_prefix             = "web-" -> "web" # forces replacement
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZGVidWciCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAid2Vic2VydmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo=" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sIgogIC0gIi0tbW9kdWxlLXBhdGgiCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzIgogIC0gImFwcGx5Igoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogIndlYnNlcnZlciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg=="
      - vpc_security_group_ids  = [] -> null
        # (3 unchanged attributes hidden)

      ~ block_device_mappings {
            # (1 unchanged attribute hidden)

          ~ ebs {
              ~ iops                  = 0 -> (known after apply)
              ~ throughput            = 0 -> (known after apply)
              + volume_type           = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.website.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
      ~ certificate_arn   = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.aws_route53_record.apex[0] will be created
  + resource "aws_route53_record" "apex" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "infrahouse.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.website.aws_route53_record.cert_validation["infrahouse.com"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com" -> (known after apply)
      ~ id                               = "Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com" # forces replacement -> (known after apply) # forces replacement
      ~ records                          = [
          - "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.website.aws_route53_record.cert_validation["www.infrahouse.com"] will be destroyed
  # (because key ["www.infrahouse.com"] is not in for_each map)
  - resource "aws_route53_record" "cert_validation" {
      - fqdn                             = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com" -> null
      - id                               = "Z07662251LH3YRF2ERM3G__c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com" -> null
      - records                          = [
          - "_a709458fbe45b7dc599cdc357f4d81b8.shzbfwcggp.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null
    }

  # module.website.aws_route53_record.extra[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route53_record" "extra" {
      - fqdn                             = "www.infrahouse.com" -> null
      - id                               = "Z07662251LH3YRF2ERM3G_www_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "www" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "web20230818170821317100000008-1219894865.us-west-1.elb.amazonaws.com" -> null
          - zone_id                = "Z368ELLRRE2KJ0" -> null
        }
    }

  # module.website.aws_route53_record.primary will be destroyed
  # (because aws_route53_record.primary is not in configuration)
  - resource "aws_route53_record" "primary" {
      - fqdn                             = "infrahouse.com" -> null
      - id                               = "Z07662251LH3YRF2ERM3G_infrahouse.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "infrahouse.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "web20230818170821317100000008-1219894865.us-west-1.elb.amazonaws.com" -> null
          - zone_id                = "Z368ELLRRE2KJ0" -> null
        }
    }

  # module.website-vpc.aws_subnet.all["10.0.4.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-086ccf1b7842243d2"
      ~ tags                                           = {
          ~ "Name"        = "10.0.4.0/24" -> "website: public 10.0.4.0/24"
            "environment" = "production"
            "management"  = "false"
            "service"     = "website"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "10.0.4.0/24" -> "website: public 10.0.4.0/24"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.website-vpc.aws_subnet.all["10.0.5.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-05fa33164c768ab65"
      ~ tags                                           = {
          ~ "Name"        = "10.0.5.0/24" -> "website: public 10.0.5.0/24"
            "environment" = "production"
            "management"  = "false"
            "service"     = "website"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "10.0.5.0/24" -> "website: public 10.0.5.0/24"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.website-vpc.aws_subnet.all["10.0.6.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-01306fa9e14f9c980"
      ~ tags                                           = {
          ~ "Name"        = "10.0.6.0/24" -> "website: private 10.0.6.0/24"
            "environment" = "production"
            "management"  = "false"
            "service"     = "website"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "10.0.6.0/24" -> "website: private 10.0.6.0/24"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.website-vpc.aws_subnet.all["10.0.7.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-06f352185ffc3fcd3"
      ~ tags                                           = {
          ~ "Name"        = "10.0.7.0/24" -> "website: private 10.0.7.0/24"
            "environment" = "production"
            "management"  = "false"
            "service"     = "website"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "10.0.7.0/24" -> "website: private 10.0.7.0/24"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.website-vpc.aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-0ae798f941be45345"
      ~ tags                                 = {
          ~ "Name"        = "VPC 10.0.4.0/22" -> "VPC for website (production) 10.0.4.0/22"
            "environment" = "production"
            "management"  = "false"
            "service"     = "website"
        }
      ~ tags_all                             = {
          ~ "Name"        = "VPC 10.0.4.0/22" -> "VPC for website (production) 10.0.4.0/22"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 7 to add, 6 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.cdn.aws_acm_certificate.cdn: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/a09201ea-e83d-43ab-8abd-75004b7d5aa5]%0Adata.aws_iam_policy_document.webserver_permissions: Reading...%0Adata.aws_iam_policy_document.webserver_permissions: Read complete after 0s [id=2218315402]%0Amodule.website.data.aws_caller_identity.current: Reading...%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.cdn.data.aws_route53_zone.ih_com: Reading...%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.website.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/webserver20230818170808801500000002]%0Amodule.website.aws_route53_record.primary: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_A]%0Adata.aws_route53_zone.infrahouse_com: Reading...%0Amodule.website-vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0ae798f941be45345]%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Adata.aws_key_pair.aleks: Reading...%0Amodule.cdn.aws_cloudfront_cache_policy.default: Refreshing state... [id=ea742fff-3eb3-4437-bfce-2ef431afcfcc]%0Amodule.website.data.aws_caller_identity.current: Read complete after 1s [id=493370826424]%0Amodule.webserver_userdata.data.aws_region.current: Reading...%0Amodule.webserver_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Reading...%0Amodule.website.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=webserver20230818170808794200000001]%0Amodule.webserver_userdata.data.cloudinit_config.config: Reading...%0Amodule.webserver_userdata.data.cloudinit_config.config: Read complete after 0s [id=1339088879]%0Amodule.cdn.aws_cloudfront_distribution.repo: Refreshing state... [id=E2S8EXIANFSP8E]%0Amodule.website.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=webserver20230818170808794200000001-20230818170809342500000004]%0Amodule.website.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=webserver]%0Adata.aws_key_pair.aleks: Read complete after 1s [id=key-01c98b9723b518061]%0Adata.aws_availability_zones.uw1: Read complete after 1s [id=us-west-1]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.4.0/24"]: Refreshing state... [id=eipalloc-03ad22a4199a2bfe5]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.5.0/24"]: Refreshing state... [id=eipalloc-0beb080e46efeb93f]%0Adata.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0ffc0965a705413c8]%0Amodule.website.aws_launch_template.website: Refreshing state... [id=lt-0cbf545f2a4d9f53c]%0Adata.aws_route53_zone.infrahouse_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.website.data.aws_route53_zone.webserver_zone: Reading...%0Amodule.cdn.data.aws_route53_zone.ih_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__a71dbd0ecfc060d317944e3be1dbf59b.cdn.infrahouse.com._CNAME]%0Amodule.cdn.aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_cdn.infrahouse.com_A]%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Reading...%0Amodule.cdn.aws_acm_certificate_validation.repo: Refreshing state... [id=2023-08-21 23:33:58.663 +0000 UTC]%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Read complete after 0s [id=us-west-1]%0Amodule.website.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.website.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be]%0Amodule.website-vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-0feb8f579048fc443]%0Amodule.website-vpc.aws_default_route_table.default: Refreshing state... [id=rtb-06b702bdb0cadd810]%0Amodule.website-vpc.aws_default_security_group.default: Refreshing state... [id=sg-089f1a85f05cbd32a]%0Amodule.website-vpc.aws_route_table.all["10.0.6.0/24"]: Refreshing state... [id=rtb-0decbbf0182384dff]%0Amodule.website-vpc.aws_route_table.all["10.0.7.0/24"]: Refreshing state... [id=rtb-0f0d4ab6650ed47a4]%0Amodule.website-vpc.aws_route_table.all["10.0.4.0/24"]: Refreshing state... [id=rtb-02ae9fc349324835b]%0Amodule.website-vpc.aws_route_table.all["10.0.5.0/24"]: Refreshing state... [id=rtb-0fc65675e5ce07bbf]%0Amodule.website-vpc.aws_subnet.all["10.0.7.0/24"]: Refreshing state... [id=subnet-06f352185ffc3fcd3]%0Amodule.website-vpc.aws_subnet.all["10.0.4.0/24"]: Refreshing state... [id=subnet-086ccf1b7842243d2]%0Amodule.website-vpc.aws_subnet.all["10.0.5.0/24"]: Refreshing state... [id=subnet-05fa33164c768ab65]%0Amodule.website-vpc.aws_vpc_peering_connection.link_to_management[0]: Refreshing state... [id=pcx-0fd00008e9a890b35]%0Amodule.website-vpc.aws_subnet.all["10.0.6.0/24"]: Refreshing state... [id=subnet-01306fa9e14f9c980]%0Amodule.website-vpc.aws_route.default_main: Refreshing state... [id=r-rtb-06b702bdb0cadd8101080289494]%0Amodule.website-vpc.aws_route.subnet_public["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b1080289494]%0Amodule.website-vpc.aws_route.subnet_public["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf1080289494]%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.4.0/24"]: Refreshing state... [id=nat-0a1c16012747ef5e4]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.7.0/24"]: Refreshing state... [id=rtbassoc-0da0fea7d999fcf5f]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.5.0/24"]: Refreshing state... [id=rtbassoc-0716045ba5eb092f0]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.6.0/24"]: Refreshing state... [id=rtbassoc-0c1a3e4c874333baf]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-04d711a4b92896be2]%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.5.0/24"]: Refreshing state... [id=nat-00ac19ae43562352f]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[0]: Refreshing state... [id=r-rtb-0d73383afeb6ad1423177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[1]: Refreshing state... [id=r-rtb-04a16e74d5b12a3383177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[2]: Refreshing state... [id=r-rtb-067c30e65dd4108e93177957334]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a4653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b653952448]%0Amodule.website.data.aws_subnet.selected: Reading...%0Amodule.website.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055]%0Amodule.website.aws_route53_record.cert_validation["www.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com._CNAME]%0Amodule.website.aws_route53_record.cert_validation["infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME]%0Amodule.website-vpc.aws_route.subnet_private["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff1080289494]%0Amodule.website-vpc.aws_route.subnet_private["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a41080289494]%0Amodule.website.data.aws_subnet.selected: Read complete after 0s [id=subnet-086ccf1b7842243d2]%0Amodule.website.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af]%0Amodule.website.aws_acm_certificate_validation.website: Refreshing state... [id=2023-08-18 17:08:33.177 +0000 UTC]%0Amodule.website.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_www_A]%0Amodule.website.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/3d984bc9f1cc3a7d]%0Amodule.website.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70]%0Amodule.website.aws_autoscaling_group.website: Refreshing state... [id=web-2023081817082248860000000b]%0Amodule.website.aws_autoscaling_policy.cpu_load: Refreshing state... [id=web-2023081817082248860000000b]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.website.data.aws_network_interface.alb[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_network_interface" "alb" {%0A      + arn               = (known after apply)%0A      + association       = (known after apply)%0A      + attachment        = (known after apply)%0A      + availability_zone = (known after apply)%0A      + description       = (known after apply)%0A      + id                = (known after apply)%0A      + interface_type    = (known after apply)%0A      + ipv6_addresses    = (known after apply)%0A      + mac_address       = (known after apply)%0A      + outpost_arn       = (known after apply)%0A      + owner_id          = (known after apply)%0A      + private_dns_name  = (known after apply)%0A      + private_ip        = (known after apply)%0A      + private_ips       = (known after apply)%0A      + requester_id      = (known after apply)%0A      + security_groups   = (known after apply)%0A      + subnet_id         = (known after apply)%0A      + tags              = (known after apply)%0A      + vpc_id            = (known after apply)%0A%0A      + filter {%0A          + name   = "description"%0A          + values = [%0A              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",%0A            ]%0A        }%0A      + filter {%0A          + name   = "subnet-id"%0A          + values = [%0A              + "subnet-086ccf1b7842243d2",%0A            ]%0A        }%0A    }%0A%0A  # module.website.data.aws_network_interface.alb[1] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_network_interface" "alb" {%0A      + arn               = (known after apply)%0A      + association       = (known after apply)%0A      + attachment        = (known after apply)%0A      + availability_zone = (known after apply)%0A      + description       = (known after apply)%0A      + id                = (known after apply)%0A      + interface_type    = (known after apply)%0A      + ipv6_addresses    = (known after apply)%0A      + mac_address       = (known after apply)%0A      + outpost_arn       = (known after apply)%0A      + owner_id          = (known after apply)%0A      + private_dns_name  = (known after apply)%0A      + private_ip        = (known after apply)%0A      + private_ips       = (known after apply)%0A      + requester_id      = (known after apply)%0A      + security_groups   = (known after apply)%0A      + subnet_id         = (known after apply)%0A      + tags              = (known after apply)%0A      + vpc_id            = (known after apply)%0A%0A      + filter {%0A          + name   = "description"%0A          + values = [%0A              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",%0A            ]%0A        }%0A      + filter {%0A          + name   = "subnet-id"%0A          + values = [%0A              + "subnet-05fa33164c768ab65",%0A            ]%0A        }%0A    }%0A%0A  # module.website.aws_acm_certificate.website must be replaced%0A-/+ resource "aws_acm_certificate" "website" {%0A      ~ arn                       = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)%0A      ~ domain_validation_options = [%0A          - {%0A              - domain_name           = "infrahouse.com"%0A              - resource_record_name  = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com."%0A              - resource_record_type  = "CNAME"%0A              - resource_record_value = "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws."%0A            },%0A          - {%0A              - domain_name           = "www.infrahouse.com"%0A              - resource_record_name  = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com."%0A              - resource_record_type  = "CNAME"%0A              - resource_record_value = "_a709458fbe45b7dc599cdc357f4d81b8.shzbfwcggp.acm-validations.aws."%0A            },%0A          + {%0A              + domain_name           = "infrahouse.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      ~ id                        = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)%0A      ~ key_algorithm             = "RSA_2048" -> (known after apply)%0A      ~ not_after                 = "2024-09-15T23:59:59Z" -> (known after apply)%0A      ~ not_before                = "2023-08-18T00:00:00Z" -> (known after apply)%0A      ~ pending_renewal           = false -> (known after apply)%0A      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)%0A      ~ renewal_summary           = [] -> (known after apply)%0A      ~ status                    = "ISSUED" -> (known after apply)%0A      ~ subject_alternative_names = [ # forces replacement%0A          - "www.infrahouse.com",%0A            # (1 unchanged element hidden)%0A        ]%0A      - tags                      = {} -> null%0A      ~ type                      = "AMAZON_ISSUED" -> (known after apply)%0A      ~ validation_emails         = [] -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A%0A      - options {%0A          - certificate_transparency_logging_preference = "ENABLED" -> null%0A        }%0A    }%0A%0A  # module.website.aws_acm_certificate_validation.website must be replaced%0A-/+ resource "aws_acm_certificate_validation" "website" {%0A      ~ certificate_arn         = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                      = "2023-08-18 17:08:33.177 +0000 UTC" -> (known after apply)%0A      ~ validation_record_fqdns = [ # forces replacement%0A          - "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com",%0A          - "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com",%0A        ] -> (known after apply) # forces replacement%0A    }%0A%0A  # module.website.aws_autoscaling_group.website must be replaced%0A+/- resource "aws_autoscaling_group" "website" {%0A      ~ arn                              = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:5b642f2f-b929-4d99-8f78-76e975e92d5f:autoScalingGroupName/web-2023081817082248860000000b" -> (known after apply)%0A      ~ availability_zones               = [%0A          - "us-west-1a",%0A          - "us-west-1c",%0A        ] -> (known after apply)%0A      - capacity_rebalance               = false -> null%0A      ~ default_cooldown                 = 300 -> (known after apply)%0A      - default_instance_warmup          = 0 -> null%0A      ~ desired_capacity                 = 2 -> (known after apply)%0A      - enabled_metrics                  = [] -> null%0A      ~ id                               = "web-2023081817082248860000000b" -> (known after apply)%0A      ~ load_balancers                   = [] -> (known after apply)%0A      ~ name                             = "web-2023081817082248860000000b" -> (known after apply)%0A      ~ name_prefix                      = "web-" -> "web" # forces replacement%0A      ~ predicted_capacity               = 0 -> (known after apply)%0A      ~ service_linked_role_arn          = "arn:aws:iam::493370826424:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)%0A      - suspended_processes              = [] -> null%0A      - termination_policies             = [] -> null%0A      ~ warm_pool_size                   = 0 -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A      + instance_refresh {%0A          + strategy = "Rolling"%0A          + triggers = [%0A              + "tag",%0A            ]%0A%0A          + preferences {%0A              + min_healthy_percentage       = 100%0A              + scale_in_protected_instances = "Ignore"%0A              + skip_matching                = false%0A              + standby_instances            = "Ignore"%0A            }%0A        }%0A%0A      ~ launch_template {%0A          ~ id      = "lt-0cbf545f2a4d9f53c" -> (known after apply)%0A          ~ name    = "web-20230818170809680400000005" -> (known after apply)%0A          ~ version = "1" -> (known after apply)%0A        }%0A%0A      - traffic_source {%0A          - identifier = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af" -> null%0A          - type       = "elbv2" -> null%0A        }%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.website.aws_autoscaling_policy.cpu_load must be replaced%0A-/+ resource "aws_autoscaling_policy" "cpu_load" {%0A      ~ arn                       = "arn:aws:autoscaling:us-west-1:493370826424:scalingPolicy:df2758a5-be4e-4cd0-8bc4-3612570e6954:autoScalingGroupName/web-2023081817082248860000000b:policyName/web-2023081817082248860000000b" -> (known after apply)%0A      ~ autoscaling_group_name    = "web-2023081817082248860000000b" # forces replacement -> (known after apply) # forces replacement%0A      - cooldown                  = 0 -> null%0A      - estimated_instance_warmup = 0 -> null%0A      ~ id                        = "web-2023081817082248860000000b" -> (known after apply)%0A      + metric_aggregation_type   = (known after apply)%0A      - min_adjustment_magnitude  = 0 -> null%0A      ~ name                      = "web-2023081817082248860000000b" # forces replacement -> (known after apply) # forces replacement%0A      - scaling_adjustment        = 0 -> null%0A        # (2 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.website.aws_launch_template.website must be replaced%0A+/- resource "aws_launch_template" "website" {%0A      ~ arn                     = "arn:aws:ec2:us-west-1:493370826424:launch-template/lt-0cbf545f2a4d9f53c" -> (known after apply)%0A      ~ default_version         = 1 -> (known after apply)%0A      - disable_api_stop        = false -> null%0A      - disable_api_termination = false -> null%0A      ~ id                      = "lt-0cbf545f2a4d9f53c" -> (known after apply)%0A      ~ image_id                = "ami-01973462ceff35e85" -> "ami-0ffc0965a705413c8"%0A      ~ latest_version          = 1 -> (known after apply)%0A      ~ name                    = "web-20230818170809680400000005" -> (known after apply)%0A      ~ name_prefix             = "web-" -> "web" # forces replacement%0A      - security_group_names    = [] -> null%0A      - tags                    = {} -> null%0A      ~ user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZGVidWciCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAid2Vic2VydmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo=" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sIgogIC0gIi0tbW9kdWxlLXBhdGgiCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzIgogIC0gImFwcGx5Igoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogIndlYnNlcnZlciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg=="%0A      - vpc_security_group_ids  = [] -> null%0A        # (3 unchanged attributes hidden)%0A%0A      ~ block_device_mappings {%0A            # (1 unchanged attribute hidden)%0A%0A          ~ ebs {%0A              ~ iops                  = 0 -> (known after apply)%0A              ~ throughput            = 0 -> (known after apply)%0A              + volume_type           = (known after apply)%0A                # (2 unchanged attributes hidden)%0A            }%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.website.aws_lb_listener.ssl will be updated in-place%0A  ~ resource "aws_lb_listener" "ssl" {%0A      ~ certificate_arn   = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)%0A        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70"%0A        tags              = {}%0A        # (6 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.website.aws_route53_record.apex[0] will be created%0A  + resource "aws_route53_record" "apex" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "infrahouse.com"%0A      + records         = (known after apply)%0A      + ttl             = 300%0A      + type            = "A"%0A      + zone_id         = "Z07662251LH3YRF2ERM3G"%0A    }%0A%0A  # module.website.aws_route53_record.cert_validation["infrahouse.com"] must be replaced%0A-/+ resource "aws_route53_record" "cert_validation" {%0A      + allow_overwrite                  = (known after apply)%0A      ~ fqdn                             = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com" -> (known after apply)%0A      ~ id                               = "Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME" -> (known after apply)%0A      - multivalue_answer_routing_policy = false -> null%0A      ~ name                             = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com" # forces replacement -> (known after apply) # forces replacement%0A      ~ records                          = [%0A          - "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws.",%0A        ] -> (known after apply)%0A      ~ type                             = "CNAME" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.website.aws_route53_record.cert_validation["www.infrahouse.com"] will be destroyed%0A  # (because key ["www.infrahouse.com"] is not in for_each map)%0A  - resource "aws_route53_record" "cert_validation" {%0A      - fqdn                             = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com" -> null%0A      - id                               = "Z07662251LH3YRF2ERM3G__c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com._CNAME" -> null%0A      - multivalue_answer_routing_policy = false -> null%0A      - name                             = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com" -> null%0A      - records                          = [%0A          - "_a709458fbe45b7dc599cdc357f4d81b8.shzbfwcggp.acm-validations.aws.",%0A        ] -> null%0A      - ttl                              = 60 -> null%0A      - type                             = "CNAME" -> null%0A      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null%0A    }%0A%0A  # module.website.aws_route53_record.extra[0] will be destroyed%0A  # (because index [0] is out of range for count)%0A  - resource "aws_route53_record" "extra" {%0A      - fqdn                             = "www.infrahouse.com" -> null%0A      - id                               = "Z07662251LH3YRF2ERM3G_www_A" -> null%0A      - multivalue_answer_routing_policy = false -> null%0A      - name                             = "www" -> null%0A      - records                          = [] -> null%0A      - ttl                              = 0 -> null%0A      - type                             = "A" -> null%0A      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null%0A%0A      - alias {%0A          - evaluate_target_health = true -> null%0A          - name                   = "web20230818170821317100000008-1219894865.us-west-1.elb.amazonaws.com" -> null%0A          - zone_id                = "Z368ELLRRE2KJ0" -> null%0A        }%0A    }%0A%0A  # module.website.aws_route53_record.primary will be destroyed%0A  # (because aws_route53_record.primary is not in configuration)%0A  - resource "aws_route53_record" "primary" {%0A      - fqdn                             = "infrahouse.com" -> null%0A      - id                               = "Z07662251LH3YRF2ERM3G_infrahouse.com_A" -> null%0A      - multivalue_answer_routing_policy = false -> null%0A      - name                             = "infrahouse.com" -> null%0A      - records                          = [] -> null%0A      - ttl                              = 0 -> null%0A      - type                             = "A" -> null%0A      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null%0A%0A      - alias {%0A          - evaluate_target_health = true -> null%0A          - name                   = "web20230818170821317100000008-1219894865.us-west-1.elb.amazonaws.com" -> null%0A          - zone_id                = "Z368ELLRRE2KJ0" -> null%0A        }%0A    }%0A%0A  # module.website-vpc.aws_subnet.all["10.0.4.0/24"] will be updated in-place%0A  ~ resource "aws_subnet" "all" {%0A        id                                             = "subnet-086ccf1b7842243d2"%0A      ~ tags                                           = {%0A          ~ "Name"        = "10.0.4.0/24" -> "website: public 10.0.4.0/24"%0A            "environment" = "production"%0A            "management"  = "false"%0A            "service"     = "website"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name"        = "10.0.4.0/24" -> "website: public 10.0.4.0/24"%0A            # (4 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.website-vpc.aws_subnet.all["10.0.5.0/24"] will be updated in-place%0A  ~ resource "aws_subnet" "all" {%0A        id                                             = "subnet-05fa33164c768ab65"%0A      ~ tags                                           = {%0A          ~ "Name"        = "10.0.5.0/24" -> "website: public 10.0.5.0/24"%0A            "environment" = "production"%0A            "management"  = "false"%0A            "service"     = "website"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name"        = "10.0.5.0/24" -> "website: public 10.0.5.0/24"%0A            # (4 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.website-vpc.aws_subnet.all["10.0.6.0/24"] will be updated in-place%0A  ~ resource "aws_subnet" "all" {%0A        id                                             = "subnet-01306fa9e14f9c980"%0A      ~ tags                                           = {%0A          ~ "Name"        = "10.0.6.0/24" -> "website: private 10.0.6.0/24"%0A            "environment" = "production"%0A            "management"  = "false"%0A            "service"     = "website"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name"        = "10.0.6.0/24" -> "website: private 10.0.6.0/24"%0A            # (4 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.website-vpc.aws_subnet.all["10.0.7.0/24"] will be updated in-place%0A  ~ resource "aws_subnet" "all" {%0A        id                                             = "subnet-06f352185ffc3fcd3"%0A      ~ tags                                           = {%0A          ~ "Name"        = "10.0.7.0/24" -> "website: private 10.0.7.0/24"%0A            "environment" = "production"%0A            "management"  = "false"%0A            "service"     = "website"%0A        }%0A      ~ tags_all                                       = {%0A          ~ "Name"        = "10.0.7.0/24" -> "website: private 10.0.7.0/24"%0A            # (4 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.website-vpc.aws_vpc.vpc will be updated in-place%0A  ~ resource "aws_vpc" "vpc" {%0A        id                                   = "vpc-0ae798f941be45345"%0A      ~ tags                                 = {%0A          ~ "Name"        = "VPC 10.0.4.0/22" -> "VPC for website (production) 10.0.4.0/22"%0A            "environment" = "production"%0A            "management"  = "false"%0A            "service"     = "website"%0A        }%0A      ~ tags_all                             = {%0A          ~ "Name"        = "VPC 10.0.4.0/22" -> "VPC for website (production) 10.0.4.0/22"%0A            # (4 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0APlan: 7 to add, 6 to change, 9 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvNTIyYTkyYjEtZTM5MS00NjdmLWFhNGYtNzA3ZTliODcyOTIxL3RlcnJhZm9ybS1iaW4gcGxhbiAtbm8tY29sb3IgLS1vdXQ9dGYucGxhblxubW9kdWxlLmNkbi5hd3NfYWNtX2NlcnRpZmljYXRlLmNkbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtZWFzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS9hMDkyMDFlYS1lODNkLTQzYWItOGFiZC03NTAwNGI3ZDVhYTVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNlcnZlcl9wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzZXJ2ZXJfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTgzMTU0MDJdXG5tb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLlxubW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uXG5tb2R1bGUuY2RuLmRhdGEuYXdzX3JvdXRlNTNfem9uZS5paF9jb206IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS93ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODgwMTUwMDAwMDAwMl1cbm1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5wcmltYXJ5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fQV1cbmRhdGEuYXdzX3JvdXRlNTNfem9uZS5pbmZyYWhvdXNlX2NvbTogUmVhZGluZy4uLlxubW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMGFlNzk4Zjk0MWJlNDUzNDVdXG5tb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddXG5kYXRhLmF3c19rZXlfcGFpci5hbGVrczogUmVhZGluZy4uLlxubW9kdWxlLmNkbi5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWE3NDJmZmYtM2ViMy00NDM3LWJmY2UtMmVmNDMxYWZjZmNjXVxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV1cbm1vZHVsZS53ZWJzaXRlLXZwYy5kYXRhLmF3c192cGMubWFuYWdlbWVudF92cGNbMF06IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3JvbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyMjAyMzA4MTgxNzA4MDg3OTQyMDAwMDAwMDFdXG5tb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5jbG91ZGluaXRfY29uZmlnLmNvbmZpZzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTMzOTA4ODg3OV1cbm1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUyUzhFWElBTkZTUDhFXVxubW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODc5NDIwMDAwMDAwMS0yMDIzMDgxODE3MDgwOTM0MjUwMDAwMDAwNF1cbm1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyXVxuZGF0YS5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWtleS0wMWM5OGI5NzIzYjUxODA2MV1cbmRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPXVzLXdlc3QtMV1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDNhZDIyYTQxOTlhMmJmZTVdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTBiZWIwODBlNDZlZmViOTNmXVxuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YW1pLTBmZmMwOTY1YTcwNTQxM2M4XVxubW9kdWxlLndlYnNpdGUuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wY2JmNTQ1ZjJhNGQ5ZjUzY11cbmRhdGEuYXdzX3JvdXRlNTNfem9uZS5pbmZyYWhvdXNlX2NvbTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXVxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkaW5nLi4uXG5tb2R1bGUuY2RuLmRhdGEuYXdzX3JvdXRlNTNfem9uZS5paF9jb206IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR11cbm1vZHVsZS5jZG4uYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcImNkbi5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX19hNzFkYmQwZWNmYzA2MGQzMTc5NDRlM2JlMWRiZjU5Yi5jZG4uaW5mcmFob3VzZS5jb20uX0NOQU1FXVxubW9kdWxlLmNkbi5hd3Nfcm91dGU1M19yZWNvcmQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2Nkbi5pbmZyYWhvdXNlLmNvbV9BXVxubW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3ZwYy5tYW5hZ2VtZW50X3ZwY1swXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXVxubW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3JvdXRlX3RhYmxlcy5tZ210X3JvdXRlX3RhYmxlc1swXTogUmVhZGluZy4uLlxubW9kdWxlLmNkbi5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wOC0yMSAyMzozMzo1OC42NjMgKzAwMDAgVVRDXVxubW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3JvdXRlX3RhYmxlcy5tZ210X3JvdXRlX3RhYmxlc1swXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddXG5tb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMGZlYjhmNTc5MDQ4ZmM0NDNdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA2YjcwMmJkYjBjYWRkODEwXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4OWYxYTg1ZjA1Y2JkMzJhXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjYuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBkZWNiYmYwMTgyMzg0ZGZmXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmMGQ0YWI2NjUwZWQ0N2E0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTAyYWU5ZmMzNDkzMjQ4MzViXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmYzY1Njc1ZTVjZTA3YmJmXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wNmYzNTIxODVmZmMzZmNkM11cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA1ZmEzMzE2NGM3NjhhYjY1XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGNfcGVlcmluZ19jb25uZWN0aW9uLmxpbmtfdG9fbWFuYWdlbWVudFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cGN4LTBmZDAwMDA4ZTlhODkwYjM1XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wMTMwNmZhOWUxNGY5Yzk4MF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuZGVmYXVsdF9tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNmI3MDJiZGIwY2FkZDgxMDEwODAyODk0OTRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDJhZTlmYzM0OTMyNDgzNWIxMDgwMjg5NDk0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmYzY1Njc1ZTVjZTA3YmJmMTA4MDI4OTQ5NF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wYTFjMTYwMTI3NDdlZjVlNF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZGEwZmVhN2Q5OTlmY2Y1Zl1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wNzE2MDQ1YmE1ZWIwOTJmMF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wYzFhM2U0Yzg3NDMzM2JhZl1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wNGQ3MTFhNGI5Mjg5NmJlMl1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wMGFjMTlhZTQzNTYyMzUyZl1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZ210X3RvX21lWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjMxNzc5NTczMzRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWdtdF90b19tZVsxXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDRhMTZlNzRkNWIxMmEzMzgzMTc3OTU3MzM0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21nbXRfdG9fbWVbMl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MzE3Nzk1NzMzNF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZV90b19tZ210W1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmYzY1Njc1ZTVjZTA3YmJmNjUzOTUyNDQ4XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjYuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGRlY2JiZjAxODIzODRkZmY2NTM5NTI0NDhdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNDY1Mzk1MjQ0OF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZV90b19tZ210W1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAyYWU5ZmMzNDkzMjQ4MzViNjUzOTUyNDQ4XVxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2l0ZS5hd3NfYWxiLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsb2FkYmFsYW5jZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTVdXG5tb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wid3d3LmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfX2M5MDU1NmJkZjJhN2Y3ODk0MDFmMWVjMDVhMGNiNTYwLnd3dy5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdXG5tb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wiaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fNzUwNGM1YzdiZGM0OWE2YmRjYWQ1MGZjN2Q2YjQ2OTcuaW5mcmFob3VzZS5jb20uX0NOQU1FXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjEwODAyODk0OTRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmMGQ0YWI2NjUwZWQ0N2E0MTA4MDI4OTQ5NF1cbm1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9c3VibmV0LTA4NmNjZjFiNzg0MjI0M2QyXVxubW9kdWxlLndlYnNpdGUuYXdzX2FsYl90YXJnZXRfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjMwODE4MTcwODIxNDAxMjAwMDAwMDBhLzRiYWIxYzg3NGRiNzQwYWZdXG5tb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wOC0xOCAxNzowODozMy4xNzcgKzAwMDAgVVRDXVxubW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmV4dHJhWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfd3d3X0FdXG5tb2R1bGUud2Vic2l0ZS5hd3NfYWxiX2xpc3RlbmVyLnJlZGlyZWN0X3RvX3NzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1LzNkOTg0YmM5ZjFjYzNhN2RdXG5tb2R1bGUud2Vic2l0ZS5hd3NfbGJfbGlzdGVuZXIuc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTUvNDZhZmFhNzEyYWU5ZmI3MF1cbm1vZHVsZS53ZWJzaXRlLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJdXG5tb2R1bGUud2Vic2l0ZS5hd3NfYXV0b3NjYWxpbmdfcG9saWN5LmNwdV9sb2FkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcbiAgfiB1cGRhdGUgaW4tcGxhY2VcbiAgLSBkZXN0cm95XG4tLysgZGVzdHJveSBhbmQgdGhlbiBjcmVhdGUgcmVwbGFjZW1lbnRcbisvLSBjcmVhdGUgcmVwbGFjZW1lbnQgYW5kIHRoZW4gZGVzdHJveVxuIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX25ldHdvcmtfaW50ZXJmYWNlLmFsYlswXSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwiYXdzX25ldHdvcmtfaW50ZXJmYWNlXCIgXCJhbGJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3NvY2lhdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXR0YWNobWVudCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGludGVyZmFjZV90eXBlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcHY2X2FkZHJlc3NlcyAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFjX2FkZHJlc3MgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHBvc3RfYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9kbnNfbmFtZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGVfaXAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2lwcyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVxdWVzdGVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwcyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdWJuZXRfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZwY19pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcImRlc2NyaXB0aW9uXCJcbiAgICAgICAgICArIHZhbHVlcyA9IFtcbiAgICAgICAgICAgICAgKyBcIkVMQiBhcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcInN1Ym5ldC1pZFwiXG4gICAgICAgICAgKyB2YWx1ZXMgPSBbXG4gICAgICAgICAgICAgICsgXCJzdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX25ldHdvcmtfaW50ZXJmYWNlLmFsYlsxXSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwiYXdzX25ldHdvcmtfaW50ZXJmYWNlXCIgXCJhbGJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3NvY2lhdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXR0YWNobWVudCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGludGVyZmFjZV90eXBlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcHY2X2FkZHJlc3NlcyAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFjX2FkZHJlc3MgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHBvc3RfYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9kbnNfbmFtZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGVfaXAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2lwcyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVxdWVzdGVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwcyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdWJuZXRfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZwY19pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcImRlc2NyaXB0aW9uXCJcbiAgICAgICAgICArIHZhbHVlcyA9IFtcbiAgICAgICAgICAgICAgKyBcIkVMQiBhcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcInN1Ym5ldC1pZFwiXG4gICAgICAgICAgKyB2YWx1ZXMgPSBbXG4gICAgICAgICAgICAgICsgXCJzdWJuZXQtMDVmYTMzMTY0Yzc2OGFiNjVcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19hY21fY2VydGlmaWNhdGUud2Vic2l0ZSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfYWNtX2NlcnRpZmljYXRlXCIgXCJ3ZWJzaXRlXCIge1xuICAgICAgfiBhcm4gICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gZG9tYWluX3ZhbGlkYXRpb25fb3B0aW9ucyA9IFtcbiAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgLSBkb21haW5fbmFtZSAgICAgICAgICAgPSBcImluZnJhaG91c2UuY29tXCJcbiAgICAgICAgICAgICAgLSByZXNvdXJjZV9yZWNvcmRfbmFtZSAgPSBcIl83NTA0YzVjN2JkYzQ5YTZiZGNhZDUwZmM3ZDZiNDY5Ny5pbmZyYWhvdXNlLmNvbS5cIlxuICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF90eXBlICA9IFwiQ05BTUVcIlxuICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF92YWx1ZSA9IFwiXzE2ZjZkZWFiZDUyZTc2ZDRlZjYxZTgwZWM0MzZiNWRmLnNoemJmd2NnZ3AuYWNtLXZhbGlkYXRpb25zLmF3cy5cIlxuICAgICAgICAgICAgfSxcbiAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgLSBkb21haW5fbmFtZSAgICAgICAgICAgPSBcInd3dy5pbmZyYWhvdXNlLmNvbVwiXG4gICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX25hbWUgID0gXCJfYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tLlwiXG4gICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX3R5cGUgID0gXCJDTkFNRVwiXG4gICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX3ZhbHVlID0gXCJfYTcwOTQ1OGZiZTQ1YjdkYzU5OWNkYzM1N2Y0ZDgxYjguc2h6YmZ3Y2dncC5hY20tdmFsaWRhdGlvbnMuYXdzLlwiXG4gICAgICAgICAgICB9LFxuICAgICAgICAgICsge1xuICAgICAgICAgICAgICArIGRvbWFpbl9uYW1lICAgICAgICAgICA9IFwiaW5mcmFob3VzZS5jb21cIlxuICAgICAgICAgICAgICArIHJlc291cmNlX3JlY29yZF9uYW1lICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyByZXNvdXJjZV9yZWNvcmRfdHlwZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgcmVzb3VyY2VfcmVjb3JkX3ZhbHVlID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfSxcbiAgICAgICAgXVxuICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4ga2V5X2FsZ29yaXRobSAgICAgICAgICAgICA9IFwiUlNBXzIwNDhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IG5vdF9hZnRlciAgICAgICAgICAgICAgICAgPSBcIjIwMjQtMDktMTVUMjM6NTk6NTlaXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBub3RfYmVmb3JlICAgICAgICAgICAgICAgID0gXCIyMDIzLTA4LTE4VDAwOjAwOjAwWlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGVuZGluZ19yZW5ld2FsICAgICAgICAgICA9IGZhbHNlIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcmVuZXdhbF9lbGlnaWJpbGl0eSAgICAgICA9IFwiRUxJR0lCTEVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHJlbmV3YWxfc3VtbWFyeSAgICAgICAgICAgPSBbXSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHN0YXR1cyAgICAgICAgICAgICAgICAgICAgPSBcIklTU1VFRFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gc3ViamVjdF9hbHRlcm5hdGl2ZV9uYW1lcyA9IFsgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgICAgICAtIFwid3d3LmluZnJhaG91c2UuY29tXCIsXG4gICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbilcbiAgICAgICAgXVxuICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgfiB0eXBlICAgICAgICAgICAgICAgICAgICAgID0gXCJBTUFaT05fSVNTVUVEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiB2YWxpZGF0aW9uX2VtYWlscyAgICAgICAgID0gW10gLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgzIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgLSBvcHRpb25zIHtcbiAgICAgICAgICAtIGNlcnRpZmljYXRlX3RyYW5zcGFyZW5jeV9sb2dnaW5nX3ByZWZlcmVuY2UgPSBcIkVOQUJMRURcIiAtPiBudWxsXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ud2Vic2l0ZSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb25cIiBcIndlYnNpdGVcIiB7XG4gICAgICB+IGNlcnRpZmljYXRlX2FybiAgICAgICAgID0gXCJhcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZVwiICMgZm9yY2VzIHJlcGxhY2VtZW50IC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgPSBcIjIwMjMtMDgtMTggMTc6MDg6MzMuMTc3ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gdmFsaWRhdGlvbl9yZWNvcmRfZnFkbnMgPSBbICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICAgICAgLSBcIl83NTA0YzVjN2JkYzQ5YTZiZGNhZDUwZmM3ZDZiNDY5Ny5pbmZyYWhvdXNlLmNvbVwiLFxuICAgICAgICAgIC0gXCJfYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tXCIsXG4gICAgICAgIF0gLT4gKGtub3duIGFmdGVyIGFwcGx5KSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlIG11c3QgYmUgcmVwbGFjZWRcbisvLSByZXNvdXJjZSBcImF3c19hdXRvc2NhbGluZ19ncm91cFwiIFwid2Vic2l0ZVwiIHtcbiAgICAgIH4gYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6YXV0b3NjYWxpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDphdXRvU2NhbGluZ0dyb3VwOjViNjQyZjJmLWI5MjktNGQ5OS04Zjc4LTc2ZTk3NWU5MmQ1ZjphdXRvU2NhbGluZ0dyb3VwTmFtZS93ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGF2YWlsYWJpbGl0eV96b25lcyAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgIC0gXCJ1cy13ZXN0LTFhXCIsXG4gICAgICAgICAgLSBcInVzLXdlc3QtMWNcIixcbiAgICAgICAgXSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIGNhcGFjaXR5X3JlYmFsYW5jZSAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgfiBkZWZhdWx0X2Nvb2xkb3duICAgICAgICAgICAgICAgICA9IDMwMCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIGRlZmF1bHRfaW5zdGFuY2Vfd2FybXVwICAgICAgICAgID0gMCAtPiBudWxsXG4gICAgICB+IGRlc2lyZWRfY2FwYWNpdHkgICAgICAgICAgICAgICAgID0gMiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIGVuYWJsZWRfbWV0cmljcyAgICAgICAgICAgICAgICAgID0gW10gLT4gbnVsbFxuICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwid2ViLTIwMjMwODE4MTcwODIyNDg4NjAwMDAwMDBiXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBsb2FkX2JhbGFuY2VycyAgICAgICAgICAgICAgICAgICA9IFtdIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gbmFtZV9wcmVmaXggICAgICAgICAgICAgICAgICAgICAgPSBcIndlYi1cIiAtPiBcIndlYlwiICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHByZWRpY3RlZF9jYXBhY2l0eSAgICAgICAgICAgICAgID0gMCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHNlcnZpY2VfbGlua2VkX3JvbGVfYXJuICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnJvbGUvYXdzLXNlcnZpY2Utcm9sZS9hdXRvc2NhbGluZy5hbWF6b25hd3MuY29tL0FXU1NlcnZpY2VSb2xlRm9yQXV0b1NjYWxpbmdcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIHN1c3BlbmRlZF9wcm9jZXNzZXMgICAgICAgICAgICAgID0gW10gLT4gbnVsbFxuICAgICAgLSB0ZXJtaW5hdGlvbl9wb2xpY2llcyAgICAgICAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIH4gd2FybV9wb29sX3NpemUgICAgICAgICAgICAgICAgICAgPSAwIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMTQgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICArIGluc3RhbmNlX3JlZnJlc2gge1xuICAgICAgICAgICsgc3RyYXRlZ3kgPSBcIlJvbGxpbmdcIlxuICAgICAgICAgICsgdHJpZ2dlcnMgPSBbXG4gICAgICAgICAgICAgICsgXCJ0YWdcIixcbiAgICAgICAgICAgIF1cblxuICAgICAgICAgICsgcHJlZmVyZW5jZXMge1xuICAgICAgICAgICAgICArIG1pbl9oZWFsdGh5X3BlcmNlbnRhZ2UgICAgICAgPSAxMDBcbiAgICAgICAgICAgICAgKyBzY2FsZV9pbl9wcm90ZWN0ZWRfaW5zdGFuY2VzID0gXCJJZ25vcmVcIlxuICAgICAgICAgICAgICArIHNraXBfbWF0Y2hpbmcgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgICAgICAgICArIHN0YW5kYnlfaW5zdGFuY2VzICAgICAgICAgICAgPSBcIklnbm9yZVwiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cblxuICAgICAgfiBsYXVuY2hfdGVtcGxhdGUge1xuICAgICAgICAgIH4gaWQgICAgICA9IFwibHQtMGNiZjU0NWYyYTRkOWY1M2NcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgfiBuYW1lICAgID0gXCJ3ZWItMjAyMzA4MTgxNzA4MDk2ODA0MDAwMDAwMDVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgfiB2ZXJzaW9uID0gXCIxXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICB9XG5cbiAgICAgIC0gdHJhZmZpY19zb3VyY2Uge1xuICAgICAgICAgIC0gaWRlbnRpZmllciA9IFwiYXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjMwODE4MTcwODIxNDAxMjAwMDAwMDBhLzRiYWIxYzg3NGRiNzQwYWZcIiAtPiBudWxsXG4gICAgICAgICAgLSB0eXBlICAgICAgID0gXCJlbGJ2MlwiIC0+IG51bGxcbiAgICAgICAgfVxuXG4gICAgICAgICMgKDUgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX3BvbGljeS5jcHVfbG9hZCBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfYXV0b3NjYWxpbmdfcG9saWN5XCIgXCJjcHVfbG9hZFwiIHtcbiAgICAgIH4gYXJuICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czphdXRvc2NhbGluZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNjYWxpbmdQb2xpY3k6ZGYyNzU4YTUtYmU0ZS00Y2QwLThiYzQtMzYxMjU3MGU2OTU0OmF1dG9TY2FsaW5nR3JvdXBOYW1lL3dlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYjpwb2xpY3lOYW1lL3dlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gYXV0b3NjYWxpbmdfZ3JvdXBfbmFtZSAgICA9IFwid2ViLTIwMjMwODE4MTcwODIyNDg4NjAwMDAwMDBiXCIgIyBmb3JjZXMgcmVwbGFjZW1lbnQgLT4gKGtub3duIGFmdGVyIGFwcGx5KSAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgLSBjb29sZG93biAgICAgICAgICAgICAgICAgID0gMCAtPiBudWxsXG4gICAgICAtIGVzdGltYXRlZF9pbnN0YW5jZV93YXJtdXAgPSAwIC0+IG51bGxcbiAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgICA9IFwid2ViLTIwMjMwODE4MTcwODIyNDg4NjAwMDAwMDBiXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtZXRyaWNfYWdncmVnYXRpb25fdHlwZSAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgLSBtaW5fYWRqdXN0bWVudF9tYWduaXR1ZGUgID0gMCAtPiBudWxsXG4gICAgICB+IG5hbWUgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiICMgZm9yY2VzIHJlcGxhY2VtZW50IC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIC0gc2NhbGluZ19hZGp1c3RtZW50ICAgICAgICA9IDAgLT4gbnVsbFxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlIG11c3QgYmUgcmVwbGFjZWRcbisvLSByZXNvdXJjZSBcImF3c19sYXVuY2hfdGVtcGxhdGVcIiBcIndlYnNpdGVcIiB7XG4gICAgICB+IGFybiAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjMjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxhdW5jaC10ZW1wbGF0ZS9sdC0wY2JmNTQ1ZjJhNGQ5ZjUzY1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gZGVmYXVsdF92ZXJzaW9uICAgICAgICAgPSAxIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gZGlzYWJsZV9hcGlfc3RvcCAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRpc2FibGVfYXBpX3Rlcm1pbmF0aW9uID0gZmFsc2UgLT4gbnVsbFxuICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgICA9IFwibHQtMGNiZjU0NWYyYTRkOWY1M2NcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGltYWdlX2lkICAgICAgICAgICAgICAgID0gXCJhbWktMDE5NzM0NjJjZWZmMzVlODVcIiAtPiBcImFtaS0wZmZjMDk2NWE3MDU0MTNjOFwiXG4gICAgICB+IGxhdGVzdF92ZXJzaW9uICAgICAgICAgID0gMSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IG5hbWUgICAgICAgICAgICAgICAgICAgID0gXCJ3ZWItMjAyMzA4MTgxNzA4MDk2ODA0MDAwMDAwMDVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IG5hbWVfcHJlZml4ICAgICAgICAgICAgID0gXCJ3ZWItXCIgLT4gXCJ3ZWJcIiAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgLSBzZWN1cml0eV9ncm91cF9uYW1lcyAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsXG4gICAgICB+IHVzZXJfZGF0YSAgICAgICAgICAgICAgID0gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpHVmlkV2NpQ2lBZ0xTQWlZWEJ3YkhraUNpSjNjbWwwWlY5bWFXeGxjeUk2Q2kwZ0ltTnZiblJsYm5RaU9pQjhMUW9nSUNBZ1cyUmxabUYxYkhSZENpQWdJQ0J5WldkcGIyNDlkWE10ZDJWemRDMHhDaUFnSW5CaGRHZ2lPaUFpTDNKdmIzUXZMbUYzY3k5amIyNW1hV2NpQ2lBZ0luQmxjbTFwYzNOcGIyNXpJam9nSWpBMk1EQWlDaTBnSW1OdmJuUmxiblFpT2lCOENpQWdJQ0FpY0hWd2NHVjBYMlZ1ZG1seWIyNXRaVzUwSWpvZ0luQnliMlIxWTNScGIyNGlDaUFnSUNBaWNIVndjR1YwWDNKdmJHVWlPaUFpZDJWaWMyVnlkbVZ5SWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzl3ZFhCd1pYUXVlV0Z0YkNJS0lDQWljR1Z5YldsemMybHZibk1pT2lBaU1EWTBOQ0lLRFFvdExVMUpUVVZDVDFWT1JFRlNXUzB0RFFvPVwiIC0+IFwiUTI5dWRHVnVkQzFVZVhCbE9pQnRkV3gwYVhCaGNuUXZiV2w0WldRN0lHSnZkVzVrWVhKNVBTSk5TVTFGUWs5VlRrUkJVbGtpQ2sxSlRVVXRWbVZ5YzJsdmJqb2dNUzR3RFFvTkNpMHRUVWxOUlVKUFZVNUVRVkpaRFFwRGIyNTBaVzUwTFZSeVlXNXpabVZ5TFVWdVkyOWthVzVuT2lBM1ltbDBEUXBEYjI1MFpXNTBMVlI1Y0dVNklIUmxlSFF2WTJ4dmRXUXRZMjl1Wm1sbkRRcE5hVzFsTFZabGNuTnBiMjQ2SURFdU1BMEtEUW9qWTJ4dmRXUXRZMjl1Wm1sbkNpSmhjSFFpT2dvZ0lDSnpiM1Z5WTJWeklqb0tJQ0FnSUNKcGJtWnlZV2h2ZFhObElqb0tJQ0FnSUNBZ0ltdGxlU0k2SUh3S0lDQWdJQ0FnSUNBdExTMHRMVUpGUjBsT0lGQkhVQ0JRVlVKTVNVTWdTMFZaSUVKTVQwTkxMUzB0TFMwS0NpQWdJQ0FnSUNBZ2JWRkpUa0pIVXpkR2RHdENSVUZFUml0WmJVUm5ObEYyYzNZMVZqWmFVWGNyVVdoNFpGUjJhazFZWlV4RE9WUTJVa1pTVmtRNU5EZHhTM3AwVGs1UmJnb2dJQ0FnSUNBZ0lDdEJMM2w0Y0hKTVFXMVhNalZWZFM4eE1XOURjM3BPVmtsSllWSXpUMWs0VFhSNWFXeGlRM1I2Vld0Q2VuWlhaR3hZTTBoMlZIYzVNVXh3T0dKNFZVd0tJQ0FnSUNBZ0lDQkZXRTlOT1c1elkzRlBjazkyWmtKcVlXNXdiRXRFUlV0UVRWazJka2xhTTJ0d01YSlZjME5PUjB4Q1REQjRNa3RhWjFVNE1IVnNVbk5OVFRoeGJrSk9DaUFnSUNBZ0lDQWdhM0JVYVVGbFdFdFBSVlowVW5wc1YyeDJUMFpNU2pkd1dVUjJZVm93VldkSVUxWjFSU3RhYTJ4a2NVOWtURXhTY0V0clpFbDJTbEJqYTFoeFREVjRWQW9nSUNBZ0lDQWdJRlYyVjFSWE1XVnVSa0ZJWkRVclRsRjRUVzVEWVROcGEycFJWak5FVkd4RmFuTm5URXhSWW1KNWMxaHFXRkJ5TmxCSlVITXlPV05VWTJadmNUUXpNVThLSUNBZ0lDQWdJQ0IwVWpSRWNscENOSFpOUlU5Qk9EaFViVXRDYTBWcFRVY3JhVUk1WTJwNk5YZENTWFZOZFRrMVdtMXZTbmhrZG1wUVVqY3lSbGxMWjNKRFdFNTBUbWhrQ2lBZ0lDQWdJQ0FnVm1WeVJWSjJjRXhVYUdSaFVtMWFaMmszYkhrclJIWnJXVGRNY1hsS1VIWmtTR054ZUdWa1owWnVVRXRTTkZRcloxTlJiV0pWVUdRNWNYRmtTbEl3VVFvZ0lDQWdJQ0FnSUV0c0wxQnRkSFZUTDNjNVoza3lXalJoZVRCUlNVdHlUa0o2VVhob1FUaE1SRnB3Y0RGeWRXWkRTalVyV2sxbFpqa3dka2h3ZDNoTkswOWhVSEo1VG13S0lDQWdJQ0FnSUNCRlpFUlhOMWxST0daMVFqVnVVSEZxZDFWQmNHMXNXVmxNU2xsc1pEZDJTamM1UlVsNEwzTnFaMmcyUnl0SlJtbHROM2hTTjFkcFVVWXZia3BsZG1aeENpQWdJQ0FnSUNBZ2RucFpUemR2Y2k5SFNVTmlObVZhZDNaUVpIUjVOemxJYlZabFVIRkZWR3hFVlRBd2IzbHZjRmQ1VkhOWmVWTlpSRk5JYmk4MFpHOVVkWGc0ZGl0R0x3b2dJQ0FnSUNBZ0lGbGxlV0oyWjNGaWNtbElOMmxUUmpoSWVIZEZSbVZFYW5KTmRGVlVTSE5ZUXpNMVJFaEdaVTFEYUVwdmVITjVTM1kwT0VvcllrbEhSbmRCVWtGUlFVSUtJQ0FnSUNBZ0lDQjBRekZLWW0xYWVWbFZhSFprV0U1c1NVWkNhRmt5ZEdoYU1sWjVTVVI0ZDFsWFRuSlpWMlJzWTJ0Q2NHSnRXbmxaVjJoMlpGaE9iRXh0VG5aaVZEWktDaUFnSUNBZ0lDQWdRV3hSUlVWM1JVdEJSRFJYU1ZGVGFVNW9OV3RaTTNjNFZ6Qm5RVVk0V0dkMVNtRnZlR1pqUkRkM1ZVTmFUSE5YTWxGSllrRjNWVXBCT0VwdVFVRlZUQW9nSUNBZ0lDQWdJRU5SWjBoQloxbFdRMmRyU1VOM1NVVkdaMGxFUVZGSlpVRlJTVmhuUVVGTFExSkVaM1ZLWVc5NFptTkVOM2RpTjBRdk9XVnVZblJQTVVSRlVXNHhVSFFLSUNBZ0lDQWdJQ0JvWjJ0MFNDdEpjbUpDWkZsU1NHczNNV2xzTW1oaWJtMUJZbTlNYTJzeFlXc3ZZV0ZSV1M5WVVVUktSbWh5UVRkcVRXdFFURTlEVW1WdmRFaHBVVzEyQ2lBZ0lDQWdJQ0FnTVZWbWNVUmpUVEpsVVRRdmVEQk9PVVl5UkV4VlUydDFkM2N4TVRkMmRIUlZiMEo0YVhKQ056SndUekJVTDJ4a09XOHpPVk5JVFVNdlJHWnJObmsyYUFvZ0lDQWdJQ0FnSUhSVVIzRjRUR2RvT0dvelJGTjVUelZGUlhKS1RHRXZNMEoyVFhGeU5HbHhZak5RVkhkT1pVUlNSV3BoZGxGS2FGaFRka1ZHYW5sQlEyOXZPV1EzY25NS0lDQWdJQ0FnSUNBM2JHaERZbUpUVUdwblZHTkhMMUJEWm5wTWNqTTNVWGw2V0dsVVVpOVVkMnBwZDFaa1ZHaGtRMU12UTB0dWMyOU5PRzVuU0hocVdGbHdTemROTm5kbkNpQWdJQ0FnSUNBZ2RIcEJPRXByU0ZweU5VMXdhM0pRUjNKblVXVjJhRXBDVEd0SVVpOXFZM05oWVVKYVRqZHVkemhoWlVoamQzZE5OQzlEYUVoSmVWcGtVVGt4TURVNWNBb2dJQ0FnSUNBZ0lFOU5ZVmx0VjIxcVVGRm1jVEZ5VDI1QlFYWkJNWGhYZHl0VVdrNTZTR2RYU1hFMGRuVnplRGRQUW5aeVJuTldaVnBPYzNGa04wOWhOSEJ5ZEZaWFp6QUtJQ0FnSUNBZ0lDQTVNV05MV2twdkwwOTJObTl3VFM5M1JGZE9NbmxDYm10dFFrTjNZVmh3YjBnMVRrUlJNakppYUc1SFZFcGxTVmRrWldrNFZWTkhjSFpDYTFSNFFra3lDaUFnSUNBZ0lDQWdXRE15Y0hsUGJWcEViamd4VERKNlRUSnBiMDUyWjFoSllqVjFOWFJxWWpsT1QybEJkRFp2VnpCSE1IZ3dNR1JuY2pOeU5uQjFPSEZ0VFhkclFsWkNRd29nSUNBZ0lDQWdJSFpYZDBWdFlYaFJibXRVYUc1aVFXUTFOMVppWVhRMEx5OTFSR05JUm5CRVlVSlFjRVpYWlVOTU1tUm1SRk55VXpscGFVczJTekZXYTNaSFRHOVlhRGdLSUNBZ0lDQWdJQ0JOY0VweGFtOWtaSEJtVG1nMGRYbG1la3Q1VGtVeFpISlJNamx0WTNkbVNXeDZXRzlRY21Jd09WYzJXa2h3YlN0MGNXUTRUV3MzTURkNmQzTmtSa2RTQ2lBZ0lDQWdJQ0FnY1ZKemVHMTBVRzQ1U2pGeVpWbGFhVloxUlRWSE1qWm1NV0ZMVkZJM2EwTkVVVkpyZFhoaVdrRlNRVUUwS3pscmJqUnpiVUpZV21OTk1IWkdjVGxTT0FvZ0lDQWdJQ0FnSURJMFdFdGFkRlJoVm0xV2IxWktUVkpSVFRRMGNWZFNLM012VXpCTmVuWmlUelYxTUdOVFZsUm9XVFkxV1hwTlRITTVNakJWV1RaMVIzQnZVekphV1hjS0lDQWdJQ0FnSUNCSlRXbHdhMkZDS3pKR05rSTRVamRXTjI1c0wxTm5ZVmhIWVRKTlpYaHJRemQzZERaaWJFWmlZWGMzY0dKMlNTdHBTVGwzVXpoQ1MwaG5UVVI2WkRCR0NpQWdJQ0FnSUNBZ1ZHcFRjVGwyWkd0V2EyWTNlVWt6YUVWM2JHeFlOM3BVTmtsTVQzWnJiazVIWW05ek1HUkdTVGt5WTBKWFVYTXJhVmhRTlRCNFJGWnBkRE1yT1cxRFJBb2dJQ0FnSUNBZ0lISjFWMVpaYXpjemJYWlRSWHBHWTNWWVEzbGlTMG8xVlM5dWVsTlJOekJLYjFGdFUxQmpOVEJTVVdwMVNFZGtlbXd2V1hwSFJtRkdialY2U1ZvMWNGQUtJQ0FnSUNBZ0lDQnJOVk1yUzFSWlpXdDZZMmxTYTBoNlltVmhOVkJxSzBFMlMxcHBiRXRxTlhsclFWSkdlbmNyUTFCNGNYTjFaV3BFYTJrM1FTdGhNMjB6VjBkeEsyMXRDaUFnSUNBZ0lDQWdRV3RzVVRSWlFtTnZiSHBPVDNCblYyTnNTVk4xUlROa05XdG5kR0ZLUVVOSlozUmxPRGRHTmxGQ1FuTnJPRzlFUWtaUlEyNWFiVzlQYVhKc1UyeGlaZ29nSUNBZ0lDQWdJRXAxUkRabVZrTktkVEo2V1RkVWFFNHhUekJ2VjFSM1FXRk9RWFpOTlRWRFRGUjJObk16Um0xMFVqa3liRzVzVVVSR2RVb3JabW80TmpOak5uRjRNVFFLSUNBZ0lDQWdJQ0JHZFU4MGJVMDNaWFZUTURoM1IyZFdSMjA1TVhkQk4ySlpiRFJoYUhoRE5sTXlRa2RDTlVaMmExcG1la0pDZDJwelptMVZWMGhCZFRkV1VscEtlR3RZQ2lBZ0lDQWdJQ0FnU25BMk9UWlBWR1JTTTFKbVNUZEpXalpQVnpaMFIwVk1hV3B6ZDFkaVlscFlZalZZVWxkRlZ6azVkbGRQTjA1SlN6WnpUM1pvVFVST2NEbGlVMDExWWdvZ0lDQWdJQ0FnSUZoUU0xQmlVSGhuZVZRd1ltMXpjekI1ZDA1WmQzVmpibVpqYlVSWWNWQldkVE5IWkhRMU0yRjBNU3RvU3pkdGJHNVJNM1ZWY3pWbFZrVlBTVWh1U20wS0lDQWdJQ0FnSUNCbU1YUnlSR2RuVTFSRk4yWnVhM2cyUTNwc0sybE5hMEZGVVVWQlFWbHJRMUJCVVZsQlVXOUJTbWhaYUVKTFNUSkliVkpxWmtSNFlsTkJRVmg0WlVNMENpQWdJQ0FnSUNBZ2JIRnFSamwzVUhaQ1VVcHJkWGhpV2tGb2MwMUNVV3RFZDIxalFVRkJiMHBGVDBNMGJIRnFSamwzVUhZNFUxRlFMMnB6VVdaS1ExVkljbXB3V0RSbVVBb2dJQ0FnSUNBZ0lEQk9kRlo1Y1d4RGNuRXhUMjFNVURkQ1RISllja040YjBGR1VtSTJORmxLVldSWGF6VlFNelZyT1hkcU1rSlJhbkJxWTA1cU1tbHJPREJHYjI4d01rVUtJQ0FnSUNBZ0lDQjVZeXRRZWxjdk5IUjZWblprZUZKeVJYcHpUMFp0SzIxTlVpdHNiRlZJUVV0NlFtRTJVVUo0U0ZRd2IyWk1OM0ExV0ZsVWRVMU9ibGx2SzFCcVZrMXRDaUFnSUNBZ0lDQWdhbEF6VkVWS1IxbFlXVzExYUVkbVlXRktXbkJxVEcxS1JuRndOVGw0THk5a2MwMUlaVXh4VlVOb2QySTJRMmMyUkhWclFXbG9aVUZ6TTFBcmNsaHZNd29nSUNBZ0lDQWdJSFJDYmtFMFNrTkRhVmhTTnk4dk1GZGxlbEp2VTFCa1lXeE9aVzAwZG5NNFVGUTROM051U0dKRWJHbEdUVlptT0hjclptdHpTVzV4ZG05MGFWSkVTVFFLSUNBZ0lDQWdJQ0JSUW5KQ1puTXpUbVJsV2xjdmRHMTFjRTloV2twU2VraEVkblpMWW1jdkwwODJhWEF4WVZCMlNVeFhkbFJFVFRoTFkxRkRVVVZUWVZkclEySkpNWFZqQ2lBZ0lDQWdJQ0FnY21sNlFVMWliRlJDTW1kNWR6bDViMnBEY0ZaRFRVSllaR2w2UVhGeGVXdzFXbFp5ZHpRcldDOXBNRGxKYzA1ME9HaEJPUzgxVWxrM2RqTmpOMW95UXdvZ0lDQWdJQ0FnSUZoNU1uaExWMjEwVEVrNWJteFBVMU4zVlhoQ05UWTJTVEk1YkZaTFFreFZiVmh0VVdadVVrbEpTRU5wU2tSWVdVWkVVQzgyVEdaMk9TdHRhRVZYVlRnS0lDQWdJQ0FnSUNCeFpXUXplR2h3WlU1VFFVbDZRU3ROVkd4cWRHbFNiVzl5ZUhCa1pHbFlZblJEWVdaalVHd3ZTak5ZTUVJd04yWmpZMHBhZDFwelExbERjSFJNZVRGakNpQWdJQ0FnSUNBZ2VYWldZVTRyUlVKdGFtOURjRE5xZERaM1RHVTBlR05zY1ZVelFVTjNlaTg0VkVSRWJYUktOMVZWWkd3M1RXUnJhWEJSV2pJM09Fd3lhM0JzTm04Mk1Rb2dJQ0FnSUNBZ0lFMUdNbVpZUkRkbVdrMWxXbVpGZHpac2RUQkNSalZ0V2pBdlkyZ3pTSGhZWlZwdldHbG1OemxuTWpWMldtMVRaRmM1TjNCalpXVjNVR3gyYkVWVVJsRUtJQ0FnSUNBZ0lDQTFOWEJOYjNKUmVWVlVSVkZEVVRORlEzcElXVk51VEM5VWJWYzNDaUFnSUNBZ0lDQWdQU3N3VW1NS0lDQWdJQ0FnSUNBdExTMHRMVVZPUkNCUVIxQWdVRlZDVEVsRElFdEZXU0JDVEU5RFN5MHRMUzB0Q2lBZ0lDQWdJQ0p6YjNWeVkyVWlPaUFpWkdWaUlGdHphV2R1WldRdFluazlKRXRGV1Y5R1NVeEZYU0JvZEhSd2N6b3ZMM0psYkdWaGMyVXRhbUZ0YlhrdWFXNW1jbUZvYjNWelpTNWpiMjB2SUNSU1JVeEZRVk5GQ2lBZ0lDQWdJQ0FnYldGcGJpSUtJbkJoWTJ0aFoyVmZkWEJrWVhSbElqb2dkSEoxWlFvaWNHRmphMkZuWlhNaU9nb3RJQ0p3ZFhCd1pYUXRZMjlrWlNJS0xTQWlhVzVtY21Gb2IzVnpaUzEwYjI5c2EybDBJZ29pY0hWd2NHVjBJam9LSUNBaVkyOXNiR1ZqZEdsdmJpSTZJQ0p3ZFhCd1pYUTRJZ29nSUNKcGJuTjBZV3hzSWpvZ2RISjFaUW9nSUNKcGJuTjBZV3hzWDNSNWNHVWlPaUFpWVdsdklnb2dJQ0p3WVdOcllXZGxYMjVoYldVaU9pQWljSFZ3Y0dWMExXRm5aVzUwSWdvZ0lDSnpkR0Z5ZEY5elpYSjJhV05sSWpvZ1ptRnNjMlVLSW5KMWJtTnRaQ0k2Q2kwZ0xTQWlhV2d0Y0hWd2NHVjBJZ29nSUMwZ0lpMHRaVzUyYVhKdmJtMWxiblFpQ2lBZ0xTQWljSEp2WkhWamRHbHZiaUlLSUNBdElDSXRMV1Z1ZG1seWIyNXRaVzUwY0dGMGFDSUtJQ0F0SUNKN2NtOXZkRjlrYVhKbFkzUnZjbmw5TDJWdWRtbHliMjV0Wlc1MGN5SUtJQ0F0SUNJdExYSnZiM1F0WkdseVpXTjBiM0o1SWdvZ0lDMGdJaTl2Y0hRdmNIVndjR1YwTFdOdlpHVWlDaUFnTFNBaUxTMW9hV1Z5WVMxamIyNW1hV2NpQ2lBZ0xTQWllM0p2YjNSZlpHbHlaV04wYjNKNWZTOWxiblpwY205dWJXVnVkSE12ZTJWdWRtbHliMjV0Wlc1MGZTOW9hV1Z5WVM1NVlXMXNJZ29nSUMwZ0lpMHRiVzlrZFd4bExYQmhkR2dpQ2lBZ0xTQWllM0p2YjNSZlpHbHlaV04wYjNKNWZTOXRiMlIxYkdWeklnb2dJQzBnSW1Gd2NHeDVJZ29pZDNKcGRHVmZabWxzWlhNaU9nb3RJQ0pqYjI1MFpXNTBJam9nZkMwS0lDQWdJRnRrWldaaGRXeDBYUW9nSUNBZ2NtVm5hVzl1UFhWekxYZGxjM1F0TVFvZ0lDSndZWFJvSWpvZ0lpOXliMjkwTHk1aGQzTXZZMjl1Wm1sbklnb2dJQ0p3WlhKdGFYTnphVzl1Y3lJNklDSXdOakF3SWdvdElDSmpiMjUwWlc1MElqb2dmQW9nSUNBZ0luQjFjSEJsZEY5bGJuWnBjbTl1YldWdWRDSTZJQ0p3Y205a2RXTjBhVzl1SWdvZ0lDQWdJbkIxY0hCbGRGOXliMnhsSWpvZ0luZGxZbk5sY25abGNpSUtJQ0FpY0dGMGFDSTZJQ0l2WlhSakwzQjFjSEJsZEd4aFluTXZabUZqZEdWeUwyWmhZM1J6TG1RdmNIVndjR1YwTG5saGJXd2lDaUFnSW5CbGNtMXBjM05wYjI1eklqb2dJakEyTkRRaUNpMGdJbU52Ym5SbGJuUWlPaUFpZTF3aWFXZ3RjSFZ3Y0dWMFhDSTZlMXdpWkdWaWRXZGNJanBtWVd4elpTeGNJbVZ1ZG1seWIyNXRaVzUwY0dGMGFGd2lPbHdpZTNKdmIzUmZaR2x5WldOMGIzSjVmUzlsYm5acGNtOXViV1Z1ZEhOY0lpeGNJbWhwWlhKaExXTnZibVpwWjF3aU9sd2llM0p2YjNSZlpHbHlaV04wYjNKNWZTOWxiblpwY205dWJXVnVkSE12ZTJWdWRtbHliMjV0Wlc1MGZTOW9hV1Z5WVM1NVlXMXNYQ0lzWENKdGIyUjFiR1V0Y0dGMGFGd2lPbHdpZTNKdmIzUmZaR2x5WldOMGIzSjVmUzl0YjJSMWJHVnpYQ0lzWENKeWIyOTBMV1JwY21WamRHOXllVndpT2x3aUwyOXdkQzl3ZFhCd1pYUXRZMjlrWlZ3aWZYMGlDaUFnSW5CaGRHZ2lPaUFpTDJWMFl5OXdkWEJ3WlhSc1lXSnpMMlpoWTNSbGNpOW1ZV04wY3k1a0wybG9MWEIxY0hCbGRDNXFjMjl1SWdvZ0lDSndaWEp0YVhOemFXOXVjeUk2SUNJd05qUTBJZ29OQ2kwdFRVbE5SVUpQVlU1RVFWSlpMUzBOQ2c9PVwiXG4gICAgICAtIHZwY19zZWN1cml0eV9ncm91cF9pZHMgID0gW10gLT4gbnVsbFxuICAgICAgICAjICgzIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgfiBibG9ja19kZXZpY2VfbWFwcGluZ3Mge1xuICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgYXR0cmlidXRlIGhpZGRlbilcblxuICAgICAgICAgIH4gZWJzIHtcbiAgICAgICAgICAgICAgfiBpb3BzICAgICAgICAgICAgICAgICAgPSAwIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgfiB0aHJvdWdocHV0ICAgICAgICAgICAgPSAwIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyB2b2x1bWVfdHlwZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cblxuICAgICAgICAjICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX2xiX2xpc3RlbmVyLnNzbCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19sYl9saXN0ZW5lclwiIFwic3NsXCIge1xuICAgICAgfiBjZXJ0aWZpY2F0ZV9hcm4gICA9IFwiYXJuOmF3czphY206dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS83ZjUwMWEzZS1lOTNhLTRkOTctOTllMy1jNmJmNTczYzU5YmVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIGlkICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTUvNDZhZmFhNzEyYWU5ZmI3MFwiXG4gICAgICAgIHRhZ3MgICAgICAgICAgICAgID0ge31cbiAgICAgICAgIyAoNiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5hcGV4WzBdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlNTNfcmVjb3JkXCIgXCJhcGV4XCIge1xuICAgICAgKyBhbGxvd19vdmVyd3JpdGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZxZG4gICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgPSBcImluZnJhaG91c2UuY29tXCJcbiAgICAgICsgcmVjb3JkcyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0dGwgICAgICAgICAgICAgPSAzMDBcbiAgICAgICsgdHlwZSAgICAgICAgICAgID0gXCJBXCJcbiAgICAgICsgem9uZV9pZCAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dcIlxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJpbmZyYWhvdXNlLmNvbVwiXSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcImNlcnRfdmFsaWRhdGlvblwiIHtcbiAgICAgICsgYWxsb3dfb3ZlcndyaXRlICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGZxZG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJfNzUwNGM1YzdiZGM0OWE2YmRjYWQ1MGZjN2Q2YjQ2OTcuaW5mcmFob3VzZS5jb21cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzc1MDRjNWM3YmRjNDlhNmJkY2FkNTBmYzdkNmI0Njk3LmluZnJhaG91c2UuY29tLl9DTkFNRVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gbXVsdGl2YWx1ZV9hbnN3ZXJfcm91dGluZ19wb2xpY3kgPSBmYWxzZSAtPiBudWxsXG4gICAgICB+IG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJfNzUwNGM1YzdiZGM0OWE2YmRjYWQ1MGZjN2Q2YjQ2OTcuaW5mcmFob3VzZS5jb21cIiAjIGZvcmNlcyByZXBsYWNlbWVudCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICB+IHJlY29yZHMgICAgICAgICAgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgIC0gXCJfMTZmNmRlYWJkNTJlNzZkNGVmNjFlODBlYzQzNmI1ZGYuc2h6YmZ3Y2dncC5hY20tdmFsaWRhdGlvbnMuYXdzLlwiLFxuICAgICAgICBdIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gdHlwZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkNOQU1FXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wid3d3LmluZnJhaG91c2UuY29tXCJdIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2Uga2V5IFtcInd3dy5pbmZyYWhvdXNlLmNvbVwiXSBpcyBub3QgaW4gZm9yX2VhY2ggbWFwKVxuICAtIHJlc291cmNlIFwiYXdzX3JvdXRlNTNfcmVjb3JkXCIgXCJjZXJ0X3ZhbGlkYXRpb25cIiB7XG4gICAgICAtIGZxZG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJfYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tXCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjA3NjYyMjUxTEgzWVJGMkVSTTNHX19jOTA1NTZiZGYyYTdmNzg5NDAxZjFlYzA1YTBjYjU2MC53d3cuaW5mcmFob3VzZS5jb20uX0NOQU1FXCIgLT4gbnVsbFxuICAgICAgLSBtdWx0aXZhbHVlX2Fuc3dlcl9yb3V0aW5nX3BvbGljeSA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIl9jOTA1NTZiZGYyYTdmNzg5NDAxZjFlYzA1YTBjYjU2MC53d3cuaW5mcmFob3VzZS5jb21cIiAtPiBudWxsXG4gICAgICAtIHJlY29yZHMgICAgICAgICAgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgIC0gXCJfYTcwOTQ1OGZiZTQ1YjdkYzU5OWNkYzM1N2Y0ZDgxYjguc2h6YmZ3Y2dncC5hY20tdmFsaWRhdGlvbnMuYXdzLlwiLFxuICAgICAgICBdIC0+IG51bGxcbiAgICAgIC0gdHRsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSA2MCAtPiBudWxsXG4gICAgICAtIHR5cGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJDTkFNRVwiIC0+IG51bGxcbiAgICAgIC0gem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR1wiIC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuZXh0cmFbMF0gd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBpbmRleCBbMF0gaXMgb3V0IG9mIHJhbmdlIGZvciBjb3VudClcbiAgLSByZXNvdXJjZSBcImF3c19yb3V0ZTUzX3JlY29yZFwiIFwiZXh0cmFcIiB7XG4gICAgICAtIGZxZG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ3d3cuaW5mcmFob3VzZS5jb21cIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dfd3d3X0FcIiAtPiBudWxsXG4gICAgICAtIG11bHRpdmFsdWVfYW5zd2VyX3JvdXRpbmdfcG9saWN5ID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwid3d3XCIgLT4gbnVsbFxuICAgICAgLSByZWNvcmRzICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gdHRsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGxcbiAgICAgIC0gdHlwZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFcIiAtPiBudWxsXG4gICAgICAtIHpvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dcIiAtPiBudWxsXG5cbiAgICAgIC0gYWxpYXMge1xuICAgICAgICAgIC0gZXZhbHVhdGVfdGFyZ2V0X2hlYWx0aCA9IHRydWUgLT4gbnVsbFxuICAgICAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICA9IFwid2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgtMTIxOTg5NDg2NS51cy13ZXN0LTEuZWxiLmFtYXpvbmF3cy5jb21cIiAtPiBudWxsXG4gICAgICAgICAgLSB6b25lX2lkICAgICAgICAgICAgICAgID0gXCJaMzY4RUxMUlJFMktKMFwiIC0+IG51bGxcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5wcmltYXJ5IHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX3JvdXRlNTNfcmVjb3JkLnByaW1hcnkgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcInByaW1hcnlcIiB7XG4gICAgICAtIGZxZG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLmNvbVwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9BXCIgLT4gbnVsbFxuICAgICAgLSBtdWx0aXZhbHVlX2Fuc3dlcl9yb3V0aW5nX3BvbGljeSA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UuY29tXCIgLT4gbnVsbFxuICAgICAgLSByZWNvcmRzICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gdHRsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGxcbiAgICAgIC0gdHlwZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFcIiAtPiBudWxsXG4gICAgICAtIHpvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dcIiAtPiBudWxsXG5cbiAgICAgIC0gYWxpYXMge1xuICAgICAgICAgIC0gZXZhbHVhdGVfdGFyZ2V0X2hlYWx0aCA9IHRydWUgLT4gbnVsbFxuICAgICAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICA9IFwid2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgtMTIxOTg5NDg2NS51cy13ZXN0LTEuZWxiLmFtYXpvbmF3cy5jb21cIiAtPiBudWxsXG4gICAgICAgICAgLSB6b25lX2lkICAgICAgICAgICAgICAgID0gXCJaMzY4RUxMUlJFMktKMFwiIC0+IG51bGxcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNC4wLzI0XCJdIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX3N1Ym5ldFwiIFwiYWxsXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJzdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIH4gXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjQuMC8yNFwiIC0+IFwid2Vic2l0ZTogcHVibGljIDEwLjAuNC4wLzI0XCJcbiAgICAgICAgICAgIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgICBcIm1hbmFnZW1lbnRcIiAgPSBcImZhbHNlXCJcbiAgICAgICAgICAgIFwic2VydmljZVwiICAgICA9IFwid2Vic2l0ZVwiXG4gICAgICAgIH1cbiAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC40LjAvMjRcIiAtPiBcIndlYnNpdGU6IHB1YmxpYyAxMC4wLjQuMC8yNFwiXG4gICAgICAgICAgICAjICg0IHVuY2hhbmdlZCBlbGVtZW50cyBoaWRkZW4pXG4gICAgICAgIH1cbiAgICAgICAgIyAoMTUgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNS4wLzI0XCJdIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX3N1Ym5ldFwiIFwiYWxsXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJzdWJuZXQtMDVmYTMzMTY0Yzc2OGFiNjVcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIH4gXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjUuMC8yNFwiIC0+IFwid2Vic2l0ZTogcHVibGljIDEwLjAuNS4wLzI0XCJcbiAgICAgICAgICAgIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgICBcIm1hbmFnZW1lbnRcIiAgPSBcImZhbHNlXCJcbiAgICAgICAgICAgIFwic2VydmljZVwiICAgICA9IFwid2Vic2l0ZVwiXG4gICAgICAgIH1cbiAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC41LjAvMjRcIiAtPiBcIndlYnNpdGU6IHB1YmxpYyAxMC4wLjUuMC8yNFwiXG4gICAgICAgICAgICAjICg0IHVuY2hhbmdlZCBlbGVtZW50cyBoaWRkZW4pXG4gICAgICAgIH1cbiAgICAgICAgIyAoMTUgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNi4wLzI0XCJdIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX3N1Ym5ldFwiIFwiYWxsXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJzdWJuZXQtMDEzMDZmYTllMTRmOWM5ODBcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIH4gXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjYuMC8yNFwiIC0+IFwid2Vic2l0ZTogcHJpdmF0ZSAxMC4wLjYuMC8yNFwiXG4gICAgICAgICAgICBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICAgXCJtYW5hZ2VtZW50XCIgID0gXCJmYWxzZVwiXG4gICAgICAgICAgICBcInNlcnZpY2VcIiAgICAgPSBcIndlYnNpdGVcIlxuICAgICAgICB9XG4gICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgfiBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuNi4wLzI0XCIgLT4gXCJ3ZWJzaXRlOiBwcml2YXRlIDEwLjAuNi4wLzI0XCJcbiAgICAgICAgICAgICMgKDQgdW5jaGFuZ2VkIGVsZW1lbnRzIGhpZGRlbilcbiAgICAgICAgfVxuICAgICAgICAjICgxNSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC43LjAvMjRcIl0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3Nfc3VibmV0XCIgXCJhbGxcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInN1Ym5ldC0wNmYzNTIxODVmZmMzZmNkM1wiXG4gICAgICB+IHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgfiBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuNy4wLzI0XCIgLT4gXCJ3ZWJzaXRlOiBwcml2YXRlIDEwLjAuNy4wLzI0XCJcbiAgICAgICAgICAgIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgICBcIm1hbmFnZW1lbnRcIiAgPSBcImZhbHNlXCJcbiAgICAgICAgICAgIFwic2VydmljZVwiICAgICA9IFwid2Vic2l0ZVwiXG4gICAgICAgIH1cbiAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC43LjAvMjRcIiAtPiBcIndlYnNpdGU6IHByaXZhdGUgMTAuMC43LjAvMjRcIlxuICAgICAgICAgICAgIyAoNCB1bmNoYW5nZWQgZWxlbWVudHMgaGlkZGVuKVxuICAgICAgICB9XG4gICAgICAgICMgKDE1IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3ZwYy52cGMgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfdnBjXCIgXCJ2cGNcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidnBjLTBhZTc5OGY5NDFiZTQ1MzQ1XCJcbiAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIH4gXCJOYW1lXCIgICAgICAgID0gXCJWUEMgMTAuMC40LjAvMjJcIiAtPiBcIlZQQyBmb3Igd2Vic2l0ZSAocHJvZHVjdGlvbikgMTAuMC40LjAvMjJcIlxuICAgICAgICAgICAgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICAgIFwibWFuYWdlbWVudFwiICA9IFwiZmFsc2VcIlxuICAgICAgICAgICAgXCJzZXJ2aWNlXCIgICAgID0gXCJ3ZWJzaXRlXCJcbiAgICAgICAgfVxuICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgfiBcIk5hbWVcIiAgICAgICAgPSBcIlZQQyAxMC4wLjQuMC8yMlwiIC0+IFwiVlBDIGZvciB3ZWJzaXRlIChwcm9kdWN0aW9uKSAxMC4wLjQuMC8yMlwiXG4gICAgICAgICAgICAjICg0IHVuY2hhbmdlZCBlbGVtZW50cyBoaWRkZW4pXG4gICAgICAgIH1cbiAgICAgICAgIyAoMTQgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuUGxhbjogNyB0byBhZGQsIDYgdG8gY2hhbmdlLCA5IHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IG1vZHVsZS5jZG4uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5jZG46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvYTA5MjAxZWEtZTgzZC00M2FiLThhYmQtNzUwMDRiN2Q1YWE1XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2VydmVyX3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzZXJ2ZXJfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTgzMTU0MDJdJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmNkbi5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuaWhfY29tOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS93ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODgwMTUwMDAwMDAwMl0lMEFtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQucHJpbWFyeTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX0FdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMGFlNzk4Zjk0MWJlNDUzNDVdJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODUxMTE5NDI3XSUwQWRhdGEuYXdzX2tleV9wYWlyLmFsZWtzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmNkbi5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWE3NDJmZmYtM2ViMy00NDM3LWJmY2UtMmVmNDMxYWZjZmNjXSUwQW1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLndlYnNlcnZlcl91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3NfdnBjLm1hbmFnZW1lbnRfdnBjWzBdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODc5NDIwMDAwMDAwMV0lMEFtb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzMzkwODg4NzldJTBBbW9kdWxlLmNkbi5hd3NfY2xvdWRmcm9udF9kaXN0cmlidXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9RTJTOEVYSUFORlNQOEVdJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODc5NDIwMDAwMDAwMS0yMDIzMDgxODE3MDgwOTM0MjUwMDAwMDAwNF0lMEFtb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNlcnZlcl0lMEFkYXRhLmF3c19rZXlfcGFpci5hbGVrczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9a2V5LTAxYzk4Yjk3MjNiNTE4MDYxXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAzYWQyMmE0MTk5YTJiZmU1XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMGJlYjA4MGU0NmVmZWI5M2ZdJTBBZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YW1pLTBmZmMwOTY1YTcwNTQxM2M4XSUwQW1vZHVsZS53ZWJzaXRlLmF3c19sYXVuY2hfdGVtcGxhdGUud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bHQtMGNiZjU0NWYyYTRkOWY1M2NdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmNkbi5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuaWhfY29tOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLmNkbi5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wiY2RuLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfX2E3MWRiZDBlY2ZjMDYwZDMxNzk0NGUzYmUxZGJmNTliLmNkbi5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdJTBBbW9kdWxlLmNkbi5hd3Nfcm91dGU1M19yZWNvcmQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2Nkbi5pbmZyYWhvdXNlLmNvbV9BXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5kYXRhLmF3c192cGMubWFuYWdlbWVudF92cGNbMF06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3Nfcm91dGVfdGFibGVzLm1nbXRfcm91dGVfdGFibGVzWzBdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmNkbi5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wOC0yMSAyMzozMzo1OC42NjMgKzAwMDAgVVRDXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5kYXRhLmF3c19yb3V0ZV90YWJsZXMubWdtdF9yb3V0ZV90YWJsZXNbMF06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19yb3V0ZTUzX3pvbmUud2Vic2VydmVyX3pvbmU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfaW50ZXJuZXRfZ2F0ZXdheS5pZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWd3LTBmZWI4ZjU3OTA0OGZjNDQzXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDZiNzAyYmRiMGNhZGQ4MTBdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4OWYxYTg1ZjA1Y2JkMzJhXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGYwZDRhYjY2NTBlZDQ3YTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTAyYWU5ZmMzNDkzMjQ4MzViXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wZmM2NTY3NWU1Y2UwN2JiZl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA2ZjM1MjE4NWZmYzNmY2QzXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wNWZhMzMxNjRjNzY4YWI2NV0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3ZwY19wZWVyaW5nX2Nvbm5lY3Rpb24ubGlua190b19tYW5hZ2VtZW50WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wY3gtMGZkMDAwMDhlOWE4OTBiMzVdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wMTMwNmZhOWUxNGY5Yzk4MF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDZiNzAyYmRiMGNhZGQ4MTAxMDgwMjg5NDk0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1YjEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmYzY1Njc1ZTVjZTA3YmJmMTA4MDI4OTQ5NF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMGExYzE2MDEyNzQ3ZWY1ZTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBkYTBmZWE3ZDk5OWZjZjVmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wNzE2MDQ1YmE1ZWIwOTJmMF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjYuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMGMxYTNlNGM4NzQzMzNiYWZdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA0ZDcxMWE0YjkyODk2YmUyXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wMGFjMTlhZTQzNTYyMzUyZl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWdtdF90b19tZVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIzMTc3OTU3MzM0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZ210X3RvX21lWzFdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODMxNzc5NTczMzRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21nbXRfdG9fbWVbMl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MzE3Nzk1NzMzNF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZmM2NTY3NWU1Y2UwN2JiZjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNDY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1YjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWxiLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsb2FkYmFsYW5jZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTVdJTBBbW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcInd3dy5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX19jOTA1NTZiZGYyYTdmNzg5NDAxZjFlYzA1YTBjYjU2MC53d3cuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJpbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX183NTA0YzVjN2JkYzQ5YTZiZGNhZDUwZmM3ZDZiNDY5Ny5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNDEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2FsYl90YXJnZXRfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjMwODE4MTcwODIxNDAxMjAwMDAwMDBhLzRiYWIxYzg3NGRiNzQwYWZdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDgtMTggMTc6MDg6MzMuMTc3ICswMDAwIFVUQ10lMEFtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuZXh0cmFbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR193d3dfQV0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWxiX2xpc3RlbmVyLnJlZGlyZWN0X3RvX3NzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1LzNkOTg0YmM5ZjFjYzNhN2RdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2xiX2xpc3RlbmVyLnNzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1LzQ2YWZhYTcxMmFlOWZiNzBdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYl0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYXV0b3NjYWxpbmdfcG9saWN5LmNwdV9sb2FkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBICB+IHVwZGF0ZSBpbi1wbGFjZSUwQSAgLSBkZXN0cm95JTBBLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50JTBBKy8tIGNyZWF0ZSByZXBsYWNlbWVudCBhbmQgdGhlbiBkZXN0cm95JTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19uZXR3b3JrX2ludGVyZmFjZS5hbGJbMF0gd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKSUwQSA8PSBkYXRhIFwiYXdzX25ldHdvcmtfaW50ZXJmYWNlXCIgXCJhbGJcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc29jaWF0aW9uICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXR0YWNobWVudCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnRlcmZhY2VfdHlwZSAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlwdjZfYWRkcmVzc2VzICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFjX2FkZHJlc3MgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwb3N0X2FybiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG93bmVyX2lkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9kbnNfbmFtZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2lwICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGVfaXBzICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVxdWVzdGVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cHMgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN1Ym5ldF9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB2cGNfaWQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIGZpbHRlciB7JTBBICAgICAgICAgICsgbmFtZSAgID0gXCJkZXNjcmlwdGlvblwiJTBBICAgICAgICAgICsgdmFsdWVzID0gWyUwQSAgICAgICAgICAgICAgKyBcIkVMQiBhcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NVwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgICArIGZpbHRlciB7JTBBICAgICAgICAgICsgbmFtZSAgID0gXCJzdWJuZXQtaWRcIiUwQSAgICAgICAgICArIHZhbHVlcyA9IFslMEEgICAgICAgICAgICAgICsgXCJzdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUuZGF0YS5hd3NfbmV0d29ya19pbnRlcmZhY2UuYWxiWzFdIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZyklMEEgPD0gZGF0YSBcImF3c19uZXR3b3JrX2ludGVyZmFjZVwiIFwiYWxiXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhc3NvY2lhdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGF0dGFjaG1lbnQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW50ZXJmYWNlX3R5cGUgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcHY2X2FkZHJlc3NlcyAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1hY19hZGRyZXNzICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cG9zdF9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGVfZG5zX25hbWUgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9pcCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2lwcyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcXVlc3Rlcl9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBzICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdWJuZXRfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdnBjX2lkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBmaWx0ZXIgeyUwQSAgICAgICAgICArIG5hbWUgICA9IFwiZGVzY3JpcHRpb25cIiUwQSAgICAgICAgICArIHZhbHVlcyA9IFslMEEgICAgICAgICAgICAgICsgXCJFTEIgYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTVcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgICAgKyBmaWx0ZXIgeyUwQSAgICAgICAgICArIG5hbWUgICA9IFwic3VibmV0LWlkXCIlMEEgICAgICAgICAgKyB2YWx1ZXMgPSBbJTBBICAgICAgICAgICAgICArIFwic3VibmV0LTA1ZmEzMzE2NGM3NjhhYjY1XCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c19hY21fY2VydGlmaWNhdGUud2Vic2l0ZSBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwiYXdzX2FjbV9jZXJ0aWZpY2F0ZVwiIFwid2Vic2l0ZVwiIHslMEEgICAgICB+IGFybiAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gZG9tYWluX3ZhbGlkYXRpb25fb3B0aW9ucyA9IFslMEEgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAtIGRvbWFpbl9uYW1lICAgICAgICAgICA9IFwiaW5mcmFob3VzZS5jb21cIiUwQSAgICAgICAgICAgICAgLSByZXNvdXJjZV9yZWNvcmRfbmFtZSAgPSBcIl83NTA0YzVjN2JkYzQ5YTZiZGNhZDUwZmM3ZDZiNDY5Ny5pbmZyYWhvdXNlLmNvbS5cIiUwQSAgICAgICAgICAgICAgLSByZXNvdXJjZV9yZWNvcmRfdHlwZSAgPSBcIkNOQU1FXCIlMEEgICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX3ZhbHVlID0gXCJfMTZmNmRlYWJkNTJlNzZkNGVmNjFlODBlYzQzNmI1ZGYuc2h6YmZ3Y2dncC5hY20tdmFsaWRhdGlvbnMuYXdzLlwiJTBBICAgICAgICAgICAgfSwlMEEgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAtIGRvbWFpbl9uYW1lICAgICAgICAgICA9IFwid3d3LmluZnJhaG91c2UuY29tXCIlMEEgICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX25hbWUgID0gXCJfYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tLlwiJTBBICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF90eXBlICA9IFwiQ05BTUVcIiUwQSAgICAgICAgICAgICAgLSByZXNvdXJjZV9yZWNvcmRfdmFsdWUgPSBcIl9hNzA5NDU4ZmJlNDViN2RjNTk5Y2RjMzU3ZjRkODFiOC5zaHpiZndjZ2dwLmFjbS12YWxpZGF0aW9ucy5hd3MuXCIlMEEgICAgICAgICAgICB9LCUwQSAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICsgZG9tYWluX25hbWUgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLmNvbVwiJTBBICAgICAgICAgICAgICArIHJlc291cmNlX3JlY29yZF9uYW1lICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgcmVzb3VyY2VfcmVjb3JkX3R5cGUgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyByZXNvdXJjZV9yZWNvcmRfdmFsdWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSwlMEEgICAgICAgIF0lMEEgICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4ga2V5X2FsZ29yaXRobSAgICAgICAgICAgICA9IFwiUlNBXzIwNDhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBub3RfYWZ0ZXIgICAgICAgICAgICAgICAgID0gXCIyMDI0LTA5LTE1VDIzOjU5OjU5WlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IG5vdF9iZWZvcmUgICAgICAgICAgICAgICAgPSBcIjIwMjMtMDgtMThUMDA6MDA6MDBaXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gcGVuZGluZ19yZW5ld2FsICAgICAgICAgICA9IGZhbHNlIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHJlbmV3YWxfZWxpZ2liaWxpdHkgICAgICAgPSBcIkVMSUdJQkxFXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gcmVuZXdhbF9zdW1tYXJ5ICAgICAgICAgICA9IFtdIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHN0YXR1cyAgICAgICAgICAgICAgICAgICAgPSBcIklTU1VFRFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHN1YmplY3RfYWx0ZXJuYXRpdmVfbmFtZXMgPSBbICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgICAgIC0gXCJ3d3cuaW5mcmFob3VzZS5jb21cIiwlMEEgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbiklMEEgICAgICAgIF0lMEEgICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsJTBBICAgICAgfiB0eXBlICAgICAgICAgICAgICAgICAgICAgID0gXCJBTUFaT05fSVNTVUVEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gdmFsaWRhdGlvbl9lbWFpbHMgICAgICAgICA9IFtdIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgIC0gb3B0aW9ucyB7JTBBICAgICAgICAgIC0gY2VydGlmaWNhdGVfdHJhbnNwYXJlbmN5X2xvZ2dpbmdfcHJlZmVyZW5jZSA9IFwiRU5BQkxFRFwiIC0+IG51bGwlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ud2Vic2l0ZSBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwiYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uXCIgXCJ3ZWJzaXRlXCIgeyUwQSAgICAgIH4gY2VydGlmaWNhdGVfYXJuICAgICAgICAgPSBcImFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXCIgIyBmb3JjZXMgcmVwbGFjZW1lbnQgLT4gKGtub3duIGFmdGVyIGFwcGx5KSAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgPSBcIjIwMjMtMDgtMTggMTc6MDg6MzMuMTc3ICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHZhbGlkYXRpb25fcmVjb3JkX2ZxZG5zID0gWyAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgICAgICAtIFwiXzc1MDRjNWM3YmRjNDlhNmJkY2FkNTBmYzdkNmI0Njk3LmluZnJhaG91c2UuY29tXCIsJTBBICAgICAgICAgIC0gXCJfYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tXCIsJTBBICAgICAgICBdIC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAud2Vic2l0ZSBtdXN0IGJlIHJlcGxhY2VkJTBBKy8tIHJlc291cmNlIFwiYXdzX2F1dG9zY2FsaW5nX2dyb3VwXCIgXCJ3ZWJzaXRlXCIgeyUwQSAgICAgIH4gYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6YXV0b3NjYWxpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDphdXRvU2NhbGluZ0dyb3VwOjViNjQyZjJmLWI5MjktNGQ5OS04Zjc4LTc2ZTk3NWU5MmQ1ZjphdXRvU2NhbGluZ0dyb3VwTmFtZS93ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBhdmFpbGFiaWxpdHlfem9uZXMgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgLSBcInVzLXdlc3QtMWFcIiwlMEEgICAgICAgICAgLSBcInVzLXdlc3QtMWNcIiwlMEEgICAgICAgIF0gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gY2FwYWNpdHlfcmViYWxhbmNlICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgfiBkZWZhdWx0X2Nvb2xkb3duICAgICAgICAgICAgICAgICA9IDMwMCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSBkZWZhdWx0X2luc3RhbmNlX3dhcm11cCAgICAgICAgICA9IDAgLT4gbnVsbCUwQSAgICAgIH4gZGVzaXJlZF9jYXBhY2l0eSAgICAgICAgICAgICAgICAgPSAyIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAtIGVuYWJsZWRfbWV0cmljcyAgICAgICAgICAgICAgICAgID0gW10gLT4gbnVsbCUwQSAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGxvYWRfYmFsYW5jZXJzICAgICAgICAgICAgICAgICAgID0gW10gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IG5hbWVfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgID0gXCJ3ZWItXCIgLT4gXCJ3ZWJcIiAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgIH4gcHJlZGljdGVkX2NhcGFjaXR5ICAgICAgICAgICAgICAgPSAwIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHNlcnZpY2VfbGlua2VkX3JvbGVfYXJuICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnJvbGUvYXdzLXNlcnZpY2Utcm9sZS9hdXRvc2NhbGluZy5hbWF6b25hd3MuY29tL0FXU1NlcnZpY2VSb2xlRm9yQXV0b1NjYWxpbmdcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSBzdXNwZW5kZWRfcHJvY2Vzc2VzICAgICAgICAgICAgICA9IFtdIC0+IG51bGwlMEEgICAgICAtIHRlcm1pbmF0aW9uX3BvbGljaWVzICAgICAgICAgICAgID0gW10gLT4gbnVsbCUwQSAgICAgIH4gd2FybV9wb29sX3NpemUgICAgICAgICAgICAgICAgICAgPSAwIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICMgKDE0IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICArIGluc3RhbmNlX3JlZnJlc2ggeyUwQSAgICAgICAgICArIHN0cmF0ZWd5ID0gXCJSb2xsaW5nXCIlMEEgICAgICAgICAgKyB0cmlnZ2VycyA9IFslMEEgICAgICAgICAgICAgICsgXCJ0YWdcIiwlMEEgICAgICAgICAgICBdJTBBJTBBICAgICAgICAgICsgcHJlZmVyZW5jZXMgeyUwQSAgICAgICAgICAgICAgKyBtaW5faGVhbHRoeV9wZXJjZW50YWdlICAgICAgID0gMTAwJTBBICAgICAgICAgICAgICArIHNjYWxlX2luX3Byb3RlY3RlZF9pbnN0YW5jZXMgPSBcIklnbm9yZVwiJTBBICAgICAgICAgICAgICArIHNraXBfbWF0Y2hpbmcgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgKyBzdGFuZGJ5X2luc3RhbmNlcyAgICAgICAgICAgID0gXCJJZ25vcmVcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgIH0lMEElMEEgICAgICB+IGxhdW5jaF90ZW1wbGF0ZSB7JTBBICAgICAgICAgIH4gaWQgICAgICA9IFwibHQtMGNiZjU0NWYyYTRkOWY1M2NcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgIH4gbmFtZSAgICA9IFwid2ViLTIwMjMwODE4MTcwODA5NjgwNDAwMDAwMDA1XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICB+IHZlcnNpb24gPSBcIjFcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB9JTBBJTBBICAgICAgLSB0cmFmZmljX3NvdXJjZSB7JTBBICAgICAgICAgIC0gaWRlbnRpZmllciA9IFwiYXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjMwODE4MTcwODIxNDAxMjAwMDAwMDBhLzRiYWIxYzg3NGRiNzQwYWZcIiAtPiBudWxsJTBBICAgICAgICAgIC0gdHlwZSAgICAgICA9IFwiZWxidjJcIiAtPiBudWxsJTBBICAgICAgICB9JTBBJTBBICAgICAgICAjICg1IHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c19hdXRvc2NhbGluZ19wb2xpY3kuY3B1X2xvYWQgbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcImF3c19hdXRvc2NhbGluZ19wb2xpY3lcIiBcImNwdV9sb2FkXCIgeyUwQSAgICAgIH4gYXJuICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czphdXRvc2NhbGluZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNjYWxpbmdQb2xpY3k6ZGYyNzU4YTUtYmU0ZS00Y2QwLThiYzQtMzYxMjU3MGU2OTU0OmF1dG9TY2FsaW5nR3JvdXBOYW1lL3dlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYjpwb2xpY3lOYW1lL3dlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGF1dG9zY2FsaW5nX2dyb3VwX25hbWUgICAgPSBcIndlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiICMgZm9yY2VzIHJlcGxhY2VtZW50IC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICAtIGNvb2xkb3duICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGwlMEEgICAgICAtIGVzdGltYXRlZF9pbnN0YW5jZV93YXJtdXAgPSAwIC0+IG51bGwlMEEgICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYi0yMDIzMDgxODE3MDgyMjQ4ODYwMDAwMDAwYlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1ldHJpY19hZ2dyZWdhdGlvbl90eXBlICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSBtaW5fYWRqdXN0bWVudF9tYWduaXR1ZGUgID0gMCAtPiBudWxsJTBBICAgICAgfiBuYW1lICAgICAgICAgICAgICAgICAgICAgID0gXCJ3ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJcIiAjIGZvcmNlcyByZXBsYWNlbWVudCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgLSBzY2FsaW5nX2FkanVzdG1lbnQgICAgICAgID0gMCAtPiBudWxsJTBBICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDEgdW5jaGFuZ2VkIGJsb2NrIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfbGF1bmNoX3RlbXBsYXRlLndlYnNpdGUgbXVzdCBiZSByZXBsYWNlZCUwQSsvLSByZXNvdXJjZSBcImF3c19sYXVuY2hfdGVtcGxhdGVcIiBcIndlYnNpdGVcIiB7JTBBICAgICAgfiBhcm4gICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czplYzI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsYXVuY2gtdGVtcGxhdGUvbHQtMGNiZjU0NWYyYTRkOWY1M2NcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBkZWZhdWx0X3ZlcnNpb24gICAgICAgICA9IDEgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gZGlzYWJsZV9hcGlfc3RvcCAgICAgICAgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgLSBkaXNhYmxlX2FwaV90ZXJtaW5hdGlvbiA9IGZhbHNlIC0+IG51bGwlMEEgICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgID0gXCJsdC0wY2JmNTQ1ZjJhNGQ5ZjUzY1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGltYWdlX2lkICAgICAgICAgICAgICAgID0gXCJhbWktMDE5NzM0NjJjZWZmMzVlODVcIiAtPiBcImFtaS0wZmZjMDk2NWE3MDU0MTNjOFwiJTBBICAgICAgfiBsYXRlc3RfdmVyc2lvbiAgICAgICAgICA9IDEgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gbmFtZSAgICAgICAgICAgICAgICAgICAgPSBcIndlYi0yMDIzMDgxODE3MDgwOTY4MDQwMDAwMDAwNVwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IG5hbWVfcHJlZml4ICAgICAgICAgICAgID0gXCJ3ZWItXCIgLT4gXCJ3ZWJcIiAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgIC0gc2VjdXJpdHlfZ3JvdXBfbmFtZXMgICAgPSBbXSAtPiBudWxsJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICB+IHVzZXJfZGF0YSAgICAgICAgICAgICAgID0gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpHVmlkV2NpQ2lBZ0xTQWlZWEJ3YkhraUNpSjNjbWwwWlY5bWFXeGxjeUk2Q2kwZ0ltTnZiblJsYm5RaU9pQjhMUW9nSUNBZ1cyUmxabUYxYkhSZENpQWdJQ0J5WldkcGIyNDlkWE10ZDJWemRDMHhDaUFnSW5CaGRHZ2lPaUFpTDNKdmIzUXZMbUYzY3k5amIyNW1hV2NpQ2lBZ0luQmxjbTFwYzNOcGIyNXpJam9nSWpBMk1EQWlDaTBnSW1OdmJuUmxiblFpT2lCOENpQWdJQ0FpY0hWd2NHVjBYMlZ1ZG1seWIyNXRaVzUwSWpvZ0luQnliMlIxWTNScGIyNGlDaUFnSUNBaWNIVndjR1YwWDNKdmJHVWlPaUFpZDJWaWMyVnlkbVZ5SWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzl3ZFhCd1pYUXVlV0Z0YkNJS0lDQWljR1Z5YldsemMybHZibk1pT2lBaU1EWTBOQ0lLRFFvdExVMUpUVVZDVDFWT1JFRlNXUzB0RFFvPVwiIC0+IFwiUTI5dWRHVnVkQzFVZVhCbE9pQnRkV3gwYVhCaGNuUXZiV2w0WldRN0lHSnZkVzVrWVhKNVBTSk5TVTFGUWs5VlRrUkJVbGtpQ2sxSlRVVXRWbVZ5YzJsdmJqb2dNUzR3RFFvTkNpMHRUVWxOUlVKUFZVNUVRVkpaRFFwRGIyNTBaVzUwTFZSeVlXNXpabVZ5TFVWdVkyOWthVzVuT2lBM1ltbDBEUXBEYjI1MFpXNTBMVlI1Y0dVNklIUmxlSFF2WTJ4dmRXUXRZMjl1Wm1sbkRRcE5hVzFsTFZabGNuTnBiMjQ2SURFdU1BMEtEUW9qWTJ4dmRXUXRZMjl1Wm1sbkNpSmhjSFFpT2dvZ0lDSnpiM1Z5WTJWeklqb0tJQ0FnSUNKcGJtWnlZV2h2ZFhObElqb0tJQ0FnSUNBZ0ltdGxlU0k2SUh3S0lDQWdJQ0FnSUNBdExTMHRMVUpGUjBsT0lGQkhVQ0JRVlVKTVNVTWdTMFZaSUVKTVQwTkxMUzB0TFMwS0NpQWdJQ0FnSUNBZ2JWRkpUa0pIVXpkR2RHdENSVUZFUml0WmJVUm5ObEYyYzNZMVZqWmFVWGNyVVdoNFpGUjJhazFZWlV4RE9WUTJVa1pTVmtRNU5EZHhTM3AwVGs1UmJnb2dJQ0FnSUNBZ0lDdEJMM2w0Y0hKTVFXMVhNalZWZFM4eE1XOURjM3BPVmtsSllWSXpUMWs0VFhSNWFXeGlRM1I2Vld0Q2VuWlhaR3hZTTBoMlZIYzVNVXh3T0dKNFZVd0tJQ0FnSUNBZ0lDQkZXRTlOT1c1elkzRlBjazkyWmtKcVlXNXdiRXRFUlV0UVRWazJka2xhTTJ0d01YSlZjME5PUjB4Q1REQjRNa3RhWjFVNE1IVnNVbk5OVFRoeGJrSk9DaUFnSUNBZ0lDQWdhM0JVYVVGbFdFdFBSVlowVW5wc1YyeDJUMFpNU2pkd1dVUjJZVm93VldkSVUxWjFSU3RhYTJ4a2NVOWtURXhTY0V0clpFbDJTbEJqYTFoeFREVjRWQW9nSUNBZ0lDQWdJRlYyVjFSWE1XVnVSa0ZJWkRVclRsRjRUVzVEWVROcGEycFJWak5FVkd4RmFuTm5URXhSWW1KNWMxaHFXRkJ5TmxCSlVITXlPV05VWTJadmNUUXpNVThLSUNBZ0lDQWdJQ0IwVWpSRWNscENOSFpOUlU5Qk9EaFViVXRDYTBWcFRVY3JhVUk1WTJwNk5YZENTWFZOZFRrMVdtMXZTbmhrZG1wUVVqY3lSbGxMWjNKRFdFNTBUbWhrQ2lBZ0lDQWdJQ0FnVm1WeVJWSjJjRXhVYUdSaFVtMWFaMmszYkhrclJIWnJXVGRNY1hsS1VIWmtTR054ZUdWa1owWnVVRXRTTkZRcloxTlJiV0pWVUdRNWNYRmtTbEl3VVFvZ0lDQWdJQ0FnSUV0c0wxQnRkSFZUTDNjNVoza3lXalJoZVRCUlNVdHlUa0o2VVhob1FUaE1SRnB3Y0RGeWRXWkRTalVyV2sxbFpqa3dka2h3ZDNoTkswOWhVSEo1VG13S0lDQWdJQ0FnSUNCRlpFUlhOMWxST0daMVFqVnVVSEZxZDFWQmNHMXNXVmxNU2xsc1pEZDJTamM1UlVsNEwzTnFaMmcyUnl0SlJtbHROM2hTTjFkcFVVWXZia3BsZG1aeENpQWdJQ0FnSUNBZ2RucFpUemR2Y2k5SFNVTmlObVZhZDNaUVpIUjVOemxJYlZabFVIRkZWR3hFVlRBd2IzbHZjRmQ1VkhOWmVWTlpSRk5JYmk4MFpHOVVkWGc0ZGl0R0x3b2dJQ0FnSUNBZ0lGbGxlV0oyWjNGaWNtbElOMmxUUmpoSWVIZEZSbVZFYW5KTmRGVlVTSE5ZUXpNMVJFaEdaVTFEYUVwdmVITjVTM1kwT0VvcllrbEhSbmRCVWtGUlFVSUtJQ0FnSUNBZ0lDQjBRekZLWW0xYWVWbFZhSFprV0U1c1NVWkNhRmt5ZEdoYU1sWjVTVVI0ZDFsWFRuSlpWMlJzWTJ0Q2NHSnRXbmxaVjJoMlpGaE9iRXh0VG5aaVZEWktDaUFnSUNBZ0lDQWdRV3hSUlVWM1JVdEJSRFJYU1ZGVGFVNW9OV3RaTTNjNFZ6Qm5RVVk0V0dkMVNtRnZlR1pqUkRkM1ZVTmFUSE5YTWxGSllrRjNWVXBCT0VwdVFVRlZUQW9nSUNBZ0lDQWdJRU5SWjBoQloxbFdRMmRyU1VOM1NVVkdaMGxFUVZGSlpVRlJTVmhuUVVGTFExSkVaM1ZLWVc5NFptTkVOM2RpTjBRdk9XVnVZblJQTVVSRlVXNHhVSFFLSUNBZ0lDQWdJQ0JvWjJ0MFNDdEpjbUpDWkZsU1NHczNNV2xzTW1oaWJtMUJZbTlNYTJzeFlXc3ZZV0ZSV1M5WVVVUktSbWh5UVRkcVRXdFFURTlEVW1WdmRFaHBVVzEyQ2lBZ0lDQWdJQ0FnTVZWbWNVUmpUVEpsVVRRdmVEQk9PVVl5UkV4VlUydDFkM2N4TVRkMmRIUlZiMEo0YVhKQ056SndUekJVTDJ4a09XOHpPVk5JVFVNdlJHWnJObmsyYUFvZ0lDQWdJQ0FnSUhSVVIzRjRUR2RvT0dvelJGTjVUelZGUlhKS1RHRXZNMEoyVFhGeU5HbHhZak5RVkhkT1pVUlNSV3BoZGxGS2FGaFRka1ZHYW5sQlEyOXZPV1EzY25NS0lDQWdJQ0FnSUNBM2JHaERZbUpUVUdwblZHTkhMMUJEWm5wTWNqTTNVWGw2V0dsVVVpOVVkMnBwZDFaa1ZHaGtRMU12UTB0dWMyOU5PRzVuU0hocVdGbHdTemROTm5kbkNpQWdJQ0FnSUNBZ2RIcEJPRXByU0ZweU5VMXdhM0pRUjNKblVXVjJhRXBDVEd0SVVpOXFZM05oWVVKYVRqZHVkemhoWlVoamQzZE5OQzlEYUVoSmVWcGtVVGt4TURVNWNBb2dJQ0FnSUNBZ0lFOU5ZVmx0VjIxcVVGRm1jVEZ5VDI1QlFYWkJNWGhYZHl0VVdrNTZTR2RYU1hFMGRuVnplRGRQUW5aeVJuTldaVnBPYzNGa04wOWhOSEJ5ZEZaWFp6QUtJQ0FnSUNBZ0lDQTVNV05MV2twdkwwOTJObTl3VFM5M1JGZE9NbmxDYm10dFFrTjNZVmh3YjBnMVRrUlJNakppYUc1SFZFcGxTVmRrWldrNFZWTkhjSFpDYTFSNFFra3lDaUFnSUNBZ0lDQWdXRE15Y0hsUGJWcEViamd4VERKNlRUSnBiMDUyWjFoSllqVjFOWFJxWWpsT1QybEJkRFp2VnpCSE1IZ3dNR1JuY2pOeU5uQjFPSEZ0VFhkclFsWkNRd29nSUNBZ0lDQWdJSFpYZDBWdFlYaFJibXRVYUc1aVFXUTFOMVppWVhRMEx5OTFSR05JUm5CRVlVSlFjRVpYWlVOTU1tUm1SRk55VXpscGFVczJTekZXYTNaSFRHOVlhRGdLSUNBZ0lDQWdJQ0JOY0VweGFtOWtaSEJtVG1nMGRYbG1la3Q1VGtVeFpISlJNamx0WTNkbVNXeDZXRzlRY21Jd09WYzJXa2h3YlN0MGNXUTRUV3MzTURkNmQzTmtSa2RTQ2lBZ0lDQWdJQ0FnY1ZKemVHMTBVRzQ1U2pGeVpWbGFhVloxUlRWSE1qWm1NV0ZMVkZJM2EwTkVVVkpyZFhoaVdrRlNRVUUwS3pscmJqUnpiVUpZV21OTk1IWkdjVGxTT0FvZ0lDQWdJQ0FnSURJMFdFdGFkRlJoVm0xV2IxWktUVkpSVFRRMGNWZFNLM012VXpCTmVuWmlUelYxTUdOVFZsUm9XVFkxV1hwTlRITTVNakJWV1RaMVIzQnZVekphV1hjS0lDQWdJQ0FnSUNCSlRXbHdhMkZDS3pKR05rSTRVamRXTjI1c0wxTm5ZVmhIWVRKTlpYaHJRemQzZERaaWJFWmlZWGMzY0dKMlNTdHBTVGwzVXpoQ1MwaG5UVVI2WkRCR0NpQWdJQ0FnSUNBZ1ZHcFRjVGwyWkd0V2EyWTNlVWt6YUVWM2JHeFlOM3BVTmtsTVQzWnJiazVIWW05ek1HUkdTVGt5WTBKWFVYTXJhVmhRTlRCNFJGWnBkRE1yT1cxRFJBb2dJQ0FnSUNBZ0lISjFWMVpaYXpjemJYWlRSWHBHWTNWWVEzbGlTMG8xVlM5dWVsTlJOekJLYjFGdFUxQmpOVEJTVVdwMVNFZGtlbXd2V1hwSFJtRkdialY2U1ZvMWNGQUtJQ0FnSUNBZ0lDQnJOVk1yUzFSWlpXdDZZMmxTYTBoNlltVmhOVkJxSzBFMlMxcHBiRXRxTlhsclFWSkdlbmNyUTFCNGNYTjFaV3BFYTJrM1FTdGhNMjB6VjBkeEsyMXRDaUFnSUNBZ0lDQWdRV3RzVVRSWlFtTnZiSHBPVDNCblYyTnNTVk4xUlROa05XdG5kR0ZLUVVOSlozUmxPRGRHTmxGQ1FuTnJPRzlFUWtaUlEyNWFiVzlQYVhKc1UyeGlaZ29nSUNBZ0lDQWdJRXAxUkRabVZrTktkVEo2V1RkVWFFNHhUekJ2VjFSM1FXRk9RWFpOTlRWRFRGUjJObk16Um0xMFVqa3liRzVzVVVSR2RVb3JabW80TmpOak5uRjRNVFFLSUNBZ0lDQWdJQ0JHZFU4MGJVMDNaWFZUTURoM1IyZFdSMjA1TVhkQk4ySlpiRFJoYUhoRE5sTXlRa2RDTlVaMmExcG1la0pDZDJwelptMVZWMGhCZFRkV1VscEtlR3RZQ2lBZ0lDQWdJQ0FnU25BMk9UWlBWR1JTTTFKbVNUZEpXalpQVnpaMFIwVk1hV3B6ZDFkaVlscFlZalZZVWxkRlZ6azVkbGRQTjA1SlN6WnpUM1pvVFVST2NEbGlVMDExWWdvZ0lDQWdJQ0FnSUZoUU0xQmlVSGhuZVZRd1ltMXpjekI1ZDA1WmQzVmpibVpqYlVSWWNWQldkVE5IWkhRMU0yRjBNU3RvU3pkdGJHNVJNM1ZWY3pWbFZrVlBTVWh1U20wS0lDQWdJQ0FnSUNCbU1YUnlSR2RuVTFSRk4yWnVhM2cyUTNwc0sybE5hMEZGVVVWQlFWbHJRMUJCVVZsQlVXOUJTbWhaYUVKTFNUSkliVkpxWmtSNFlsTkJRVmg0WlVNMENpQWdJQ0FnSUNBZ2JIRnFSamwzVUhaQ1VVcHJkWGhpV2tGb2MwMUNVV3RFZDIxalFVRkJiMHBGVDBNMGJIRnFSamwzVUhZNFUxRlFMMnB6VVdaS1ExVkljbXB3V0RSbVVBb2dJQ0FnSUNBZ0lEQk9kRlo1Y1d4RGNuRXhUMjFNVURkQ1RISllja040YjBGR1VtSTJORmxLVldSWGF6VlFNelZyT1hkcU1rSlJhbkJxWTA1cU1tbHJPREJHYjI4d01rVUtJQ0FnSUNBZ0lDQjVZeXRRZWxjdk5IUjZWblprZUZKeVJYcHpUMFp0SzIxTlVpdHNiRlZJUVV0NlFtRTJVVUo0U0ZRd2IyWk1OM0ExV0ZsVWRVMU9ibGx2SzFCcVZrMXRDaUFnSUNBZ0lDQWdhbEF6VkVWS1IxbFlXVzExYUVkbVlXRktXbkJxVEcxS1JuRndOVGw0THk5a2MwMUlaVXh4VlVOb2QySTJRMmMyUkhWclFXbG9aVUZ6TTFBcmNsaHZNd29nSUNBZ0lDQWdJSFJDYmtFMFNrTkRhVmhTTnk4dk1GZGxlbEp2VTFCa1lXeE9aVzAwZG5NNFVGUTROM051U0dKRWJHbEdUVlptT0hjclptdHpTVzV4ZG05MGFWSkVTVFFLSUNBZ0lDQWdJQ0JSUW5KQ1puTXpUbVJsV2xjdmRHMTFjRTloV2twU2VraEVkblpMWW1jdkwwODJhWEF4WVZCMlNVeFhkbFJFVFRoTFkxRkRVVVZUWVZkclEySkpNWFZqQ2lBZ0lDQWdJQ0FnY21sNlFVMWliRlJDTW1kNWR6bDViMnBEY0ZaRFRVSllaR2w2UVhGeGVXdzFXbFp5ZHpRcldDOXBNRGxKYzA1ME9HaEJPUzgxVWxrM2RqTmpOMW95UXdvZ0lDQWdJQ0FnSUZoNU1uaExWMjEwVEVrNWJteFBVMU4zVlhoQ05UWTJTVEk1YkZaTFFreFZiVmh0VVdadVVrbEpTRU5wU2tSWVdVWkVVQzgyVEdaMk9TdHRhRVZYVlRnS0lDQWdJQ0FnSUNCeFpXUXplR2h3WlU1VFFVbDZRU3ROVkd4cWRHbFNiVzl5ZUhCa1pHbFlZblJEWVdaalVHd3ZTak5ZTUVJd04yWmpZMHBhZDFwelExbERjSFJNZVRGakNpQWdJQ0FnSUNBZ2VYWldZVTRyUlVKdGFtOURjRE5xZERaM1RHVTBlR05zY1ZVelFVTjNlaTg0VkVSRWJYUktOMVZWWkd3M1RXUnJhWEJSV2pJM09Fd3lhM0JzTm04Mk1Rb2dJQ0FnSUNBZ0lFMUdNbVpZUkRkbVdrMWxXbVpGZHpac2RUQkNSalZ0V2pBdlkyZ3pTSGhZWlZwdldHbG1OemxuTWpWMldtMVRaRmM1TjNCalpXVjNVR3gyYkVWVVJsRUtJQ0FnSUNBZ0lDQTFOWEJOYjNKUmVWVlVSVkZEVVRORlEzcElXVk51VEM5VWJWYzNDaUFnSUNBZ0lDQWdQU3N3VW1NS0lDQWdJQ0FnSUNBdExTMHRMVVZPUkNCUVIxQWdVRlZDVEVsRElFdEZXU0JDVEU5RFN5MHRMUzB0Q2lBZ0lDQWdJQ0p6YjNWeVkyVWlPaUFpWkdWaUlGdHphV2R1WldRdFluazlKRXRGV1Y5R1NVeEZYU0JvZEhSd2N6b3ZMM0psYkdWaGMyVXRhbUZ0YlhrdWFXNW1jbUZvYjNWelpTNWpiMjB2SUNSU1JVeEZRVk5GQ2lBZ0lDQWdJQ0FnYldGcGJpSUtJbkJoWTJ0aFoyVmZkWEJrWVhSbElqb2dkSEoxWlFvaWNHRmphMkZuWlhNaU9nb3RJQ0p3ZFhCd1pYUXRZMjlrWlNJS0xTQWlhVzVtY21Gb2IzVnpaUzEwYjI5c2EybDBJZ29pY0hWd2NHVjBJam9LSUNBaVkyOXNiR1ZqZEdsdmJpSTZJQ0p3ZFhCd1pYUTRJZ29nSUNKcGJuTjBZV3hzSWpvZ2RISjFaUW9nSUNKcGJuTjBZV3hzWDNSNWNHVWlPaUFpWVdsdklnb2dJQ0p3WVdOcllXZGxYMjVoYldVaU9pQWljSFZ3Y0dWMExXRm5aVzUwSWdvZ0lDSnpkR0Z5ZEY5elpYSjJhV05sSWpvZ1ptRnNjMlVLSW5KMWJtTnRaQ0k2Q2kwZ0xTQWlhV2d0Y0hWd2NHVjBJZ29nSUMwZ0lpMHRaVzUyYVhKdmJtMWxiblFpQ2lBZ0xTQWljSEp2WkhWamRHbHZiaUlLSUNBdElDSXRMV1Z1ZG1seWIyNXRaVzUwY0dGMGFDSUtJQ0F0SUNKN2NtOXZkRjlrYVhKbFkzUnZjbmw5TDJWdWRtbHliMjV0Wlc1MGN5SUtJQ0F0SUNJdExYSnZiM1F0WkdseVpXTjBiM0o1SWdvZ0lDMGdJaTl2Y0hRdmNIVndjR1YwTFdOdlpHVWlDaUFnTFNBaUxTMW9hV1Z5WVMxamIyNW1hV2NpQ2lBZ0xTQWllM0p2YjNSZlpHbHlaV04wYjNKNWZTOWxiblpwY205dWJXVnVkSE12ZTJWdWRtbHliMjV0Wlc1MGZTOW9hV1Z5WVM1NVlXMXNJZ29nSUMwZ0lpMHRiVzlrZFd4bExYQmhkR2dpQ2lBZ0xTQWllM0p2YjNSZlpHbHlaV04wYjNKNWZTOXRiMlIxYkdWeklnb2dJQzBnSW1Gd2NHeDVJZ29pZDNKcGRHVmZabWxzWlhNaU9nb3RJQ0pqYjI1MFpXNTBJam9nZkMwS0lDQWdJRnRrWldaaGRXeDBYUW9nSUNBZ2NtVm5hVzl1UFhWekxYZGxjM1F0TVFvZ0lDSndZWFJvSWpvZ0lpOXliMjkwTHk1aGQzTXZZMjl1Wm1sbklnb2dJQ0p3WlhKdGFYTnphVzl1Y3lJNklDSXdOakF3SWdvdElDSmpiMjUwWlc1MElqb2dmQW9nSUNBZ0luQjFjSEJsZEY5bGJuWnBjbTl1YldWdWRDSTZJQ0p3Y205a2RXTjBhVzl1SWdvZ0lDQWdJbkIxY0hCbGRGOXliMnhsSWpvZ0luZGxZbk5sY25abGNpSUtJQ0FpY0dGMGFDSTZJQ0l2WlhSakwzQjFjSEJsZEd4aFluTXZabUZqZEdWeUwyWmhZM1J6TG1RdmNIVndjR1YwTG5saGJXd2lDaUFnSW5CbGNtMXBjM05wYjI1eklqb2dJakEyTkRRaUNpMGdJbU52Ym5SbGJuUWlPaUFpZTF3aWFXZ3RjSFZ3Y0dWMFhDSTZlMXdpWkdWaWRXZGNJanBtWVd4elpTeGNJbVZ1ZG1seWIyNXRaVzUwY0dGMGFGd2lPbHdpZTNKdmIzUmZaR2x5WldOMGIzSjVmUzlsYm5acGNtOXViV1Z1ZEhOY0lpeGNJbWhwWlhKaExXTnZibVpwWjF3aU9sd2llM0p2YjNSZlpHbHlaV04wYjNKNWZTOWxiblpwY205dWJXVnVkSE12ZTJWdWRtbHliMjV0Wlc1MGZTOW9hV1Z5WVM1NVlXMXNYQ0lzWENKdGIyUjFiR1V0Y0dGMGFGd2lPbHdpZTNKdmIzUmZaR2x5WldOMGIzSjVmUzl0YjJSMWJHVnpYQ0lzWENKeWIyOTBMV1JwY21WamRHOXllVndpT2x3aUwyOXdkQzl3ZFhCd1pYUXRZMjlrWlZ3aWZYMGlDaUFnSW5CaGRHZ2lPaUFpTDJWMFl5OXdkWEJ3WlhSc1lXSnpMMlpoWTNSbGNpOW1ZV04wY3k1a0wybG9MWEIxY0hCbGRDNXFjMjl1SWdvZ0lDSndaWEp0YVhOemFXOXVjeUk2SUNJd05qUTBJZ29OQ2kwdFRVbE5SVUpQVlU1RVFWSlpMUzBOQ2c9PVwiJTBBICAgICAgLSB2cGNfc2VjdXJpdHlfZ3JvdXBfaWRzICA9IFtdIC0+IG51bGwlMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgIH4gYmxvY2tfZGV2aWNlX21hcHBpbmdzIHslMEEgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBhdHRyaWJ1dGUgaGlkZGVuKSUwQSUwQSAgICAgICAgICB+IGVicyB7JTBBICAgICAgICAgICAgICB+IGlvcHMgICAgICAgICAgICAgICAgICA9IDAgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgfiB0aHJvdWdocHV0ICAgICAgICAgICAgPSAwIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgdm9sdW1lX3R5cGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgICAgICAgICB9JTBBICAgICAgICB9JTBBJTBBICAgICAgICAjICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUuYXdzX2xiX2xpc3RlbmVyLnNzbCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfbGJfbGlzdGVuZXJcIiBcInNzbFwiIHslMEEgICAgICB+IGNlcnRpZmljYXRlX2FybiAgID0gXCJhcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZVwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIGlkICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTUvNDZhZmFhNzEyYWU5ZmI3MFwiJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICA9IHt9JTBBICAgICAgICAjICg2IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDEgdW5jaGFuZ2VkIGJsb2NrIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuYXBleFswXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcImFwZXhcIiB7JTBBICAgICAgKyBhbGxvd19vdmVyd3JpdGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmcWRuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgPSBcImluZnJhaG91c2UuY29tXCIlMEEgICAgICArIHJlY29yZHMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHR0bCAgICAgICAgICAgICA9IDMwMCUwQSAgICAgICsgdHlwZSAgICAgICAgICAgID0gXCJBXCIlMEEgICAgICArIHpvbmVfaWQgICAgICAgICA9IFwiWjA3NjYyMjUxTEgzWVJGMkVSTTNHXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wiaW5mcmFob3VzZS5jb21cIl0gbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcImF3c19yb3V0ZTUzX3JlY29yZFwiIFwiY2VydF92YWxpZGF0aW9uXCIgeyUwQSAgICAgICsgYWxsb3dfb3ZlcndyaXRlICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBmcWRuICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiXzc1MDRjNWM3YmRjNDlhNmJkY2FkNTBmYzdkNmI0Njk3LmluZnJhaG91c2UuY29tXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR19fNzUwNGM1YzdiZGM0OWE2YmRjYWQ1MGZjN2Q2YjQ2OTcuaW5mcmFob3VzZS5jb20uX0NOQU1FXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gbXVsdGl2YWx1ZV9hbnN3ZXJfcm91dGluZ19wb2xpY3kgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgfiBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiXzc1MDRjNWM3YmRjNDlhNmJkY2FkNTBmYzdkNmI0Njk3LmluZnJhaG91c2UuY29tXCIgIyBmb3JjZXMgcmVwbGFjZW1lbnQgLT4gKGtub3duIGFmdGVyIGFwcGx5KSAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgIH4gcmVjb3JkcyAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgIC0gXCJfMTZmNmRlYWJkNTJlNzZkNGVmNjFlODBlYzQzNmI1ZGYuc2h6YmZ3Y2dncC5hY20tdmFsaWRhdGlvbnMuYXdzLlwiLCUwQSAgICAgICAgXSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiB0eXBlICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQ05BTUVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wid3d3LmluZnJhaG91c2UuY29tXCJdIHdpbGwgYmUgZGVzdHJveWVkJTBBICAjIChiZWNhdXNlIGtleSBbXCJ3d3cuaW5mcmFob3VzZS5jb21cIl0gaXMgbm90IGluIGZvcl9lYWNoIG1hcCklMEEgIC0gcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcImNlcnRfdmFsaWRhdGlvblwiIHslMEEgICAgICAtIGZxZG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJfYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tXCIgLT4gbnVsbCUwQSAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR19fYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tLl9DTkFNRVwiIC0+IG51bGwlMEEgICAgICAtIG11bHRpdmFsdWVfYW5zd2VyX3JvdXRpbmdfcG9saWN5ID0gZmFsc2UgLT4gbnVsbCUwQSAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIl9jOTA1NTZiZGYyYTdmNzg5NDAxZjFlYzA1YTBjYjU2MC53d3cuaW5mcmFob3VzZS5jb21cIiAtPiBudWxsJTBBICAgICAgLSByZWNvcmRzICAgICAgICAgICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgLSBcIl9hNzA5NDU4ZmJlNDViN2RjNTk5Y2RjMzU3ZjRkODFiOC5zaHpiZndjZ2dwLmFjbS12YWxpZGF0aW9ucy5hd3MuXCIsJTBBICAgICAgICBdIC0+IG51bGwlMEEgICAgICAtIHR0bCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gNjAgLT4gbnVsbCUwQSAgICAgIC0gdHlwZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkNOQU1FXCIgLT4gbnVsbCUwQSAgICAgIC0gem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR1wiIC0+IG51bGwlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuZXh0cmFbMF0gd2lsbCBiZSBkZXN0cm95ZWQlMEEgICMgKGJlY2F1c2UgaW5kZXggWzBdIGlzIG91dCBvZiByYW5nZSBmb3IgY291bnQpJTBBICAtIHJlc291cmNlIFwiYXdzX3JvdXRlNTNfcmVjb3JkXCIgXCJleHRyYVwiIHslMEEgICAgICAtIGZxZG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ3d3cuaW5mcmFob3VzZS5jb21cIiAtPiBudWxsJTBBICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjA3NjYyMjUxTEgzWVJGMkVSTTNHX3d3d19BXCIgLT4gbnVsbCUwQSAgICAgIC0gbXVsdGl2YWx1ZV9hbnN3ZXJfcm91dGluZ19wb2xpY3kgPSBmYWxzZSAtPiBudWxsJTBBICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwid3d3XCIgLT4gbnVsbCUwQSAgICAgIC0gcmVjb3JkcyAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSAtPiBudWxsJTBBICAgICAgLSB0dGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IDAgLT4gbnVsbCUwQSAgICAgIC0gdHlwZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFcIiAtPiBudWxsJTBBICAgICAgLSB6b25lX2lkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjA3NjYyMjUxTEgzWVJGMkVSTTNHXCIgLT4gbnVsbCUwQSUwQSAgICAgIC0gYWxpYXMgeyUwQSAgICAgICAgICAtIGV2YWx1YXRlX3RhcmdldF9oZWFsdGggPSB0cnVlIC0+IG51bGwlMEEgICAgICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgID0gXCJ3ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC0xMjE5ODk0ODY1LnVzLXdlc3QtMS5lbGIuYW1hem9uYXdzLmNvbVwiIC0+IG51bGwlMEEgICAgICAgICAgLSB6b25lX2lkICAgICAgICAgICAgICAgID0gXCJaMzY4RUxMUlJFMktKMFwiIC0+IG51bGwlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQucHJpbWFyeSB3aWxsIGJlIGRlc3Ryb3llZCUwQSAgIyAoYmVjYXVzZSBhd3Nfcm91dGU1M19yZWNvcmQucHJpbWFyeSBpcyBub3QgaW4gY29uZmlndXJhdGlvbiklMEEgIC0gcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcInByaW1hcnlcIiB7JTBBICAgICAgLSBmcWRuICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS5jb21cIiAtPiBudWxsJTBBICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX0FcIiAtPiBudWxsJTBBICAgICAgLSBtdWx0aXZhbHVlX2Fuc3dlcl9yb3V0aW5nX3BvbGljeSA9IGZhbHNlIC0+IG51bGwlMEEgICAgICAtIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLmNvbVwiIC0+IG51bGwlMEEgICAgICAtIHJlY29yZHMgICAgICAgICAgICAgICAgICAgICAgICAgID0gW10gLT4gbnVsbCUwQSAgICAgIC0gdHRsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAwIC0+IG51bGwlMEEgICAgICAtIHR5cGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJBXCIgLT4gbnVsbCUwQSAgICAgIC0gem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR1wiIC0+IG51bGwlMEElMEEgICAgICAtIGFsaWFzIHslMEEgICAgICAgICAgLSBldmFsdWF0ZV90YXJnZXRfaGVhbHRoID0gdHJ1ZSAtPiBudWxsJTBBICAgICAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICA9IFwid2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgtMTIxOTg5NDg2NS51cy13ZXN0LTEuZWxiLmFtYXpvbmF3cy5jb21cIiAtPiBudWxsJTBBICAgICAgICAgIC0gem9uZV9pZCAgICAgICAgICAgICAgICA9IFwiWjM2OEVMTFJSRTJLSjBcIiAtPiBudWxsJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC40LjAvMjRcIl0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX3N1Ym5ldFwiIFwiYWxsXCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwic3VibmV0LTA4NmNjZjFiNzg0MjI0M2QyXCIlMEEgICAgICB+IHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIH4gXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjQuMC8yNFwiIC0+IFwid2Vic2l0ZTogcHVibGljIDEwLjAuNC4wLzI0XCIlMEEgICAgICAgICAgICBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICAgIFwibWFuYWdlbWVudFwiICA9IFwiZmFsc2VcIiUwQSAgICAgICAgICAgIFwic2VydmljZVwiICAgICA9IFwid2Vic2l0ZVwiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC40LjAvMjRcIiAtPiBcIndlYnNpdGU6IHB1YmxpYyAxMC4wLjQuMC8yNFwiJTBBICAgICAgICAgICAgIyAoNCB1bmNoYW5nZWQgZWxlbWVudHMgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICAgICAgIyAoMTUgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNS4wLzI0XCJdIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19zdWJuZXRcIiBcImFsbFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInN1Ym5ldC0wNWZhMzMxNjRjNzY4YWI2NVwiJTBBICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC41LjAvMjRcIiAtPiBcIndlYnNpdGU6IHB1YmxpYyAxMC4wLjUuMC8yNFwiJTBBICAgICAgICAgICAgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgICBcIm1hbmFnZW1lbnRcIiAgPSBcImZhbHNlXCIlMEEgICAgICAgICAgICBcInNlcnZpY2VcIiAgICAgPSBcIndlYnNpdGVcIiUwQSAgICAgICAgfSUwQSAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgfiBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuNS4wLzI0XCIgLT4gXCJ3ZWJzaXRlOiBwdWJsaWMgMTAuMC41LjAvMjRcIiUwQSAgICAgICAgICAgICMgKDQgdW5jaGFuZ2VkIGVsZW1lbnRzIGhpZGRlbiklMEEgICAgICAgIH0lMEEgICAgICAgICMgKDE1IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjYuMC8yNFwiXSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3Nfc3VibmV0XCIgXCJhbGxcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJzdWJuZXQtMDEzMDZmYTllMTRmOWM5ODBcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgfiBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuNi4wLzI0XCIgLT4gXCJ3ZWJzaXRlOiBwcml2YXRlIDEwLjAuNi4wLzI0XCIlMEEgICAgICAgICAgICBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICAgIFwibWFuYWdlbWVudFwiICA9IFwiZmFsc2VcIiUwQSAgICAgICAgICAgIFwic2VydmljZVwiICAgICA9IFwid2Vic2l0ZVwiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC42LjAvMjRcIiAtPiBcIndlYnNpdGU6IHByaXZhdGUgMTAuMC42LjAvMjRcIiUwQSAgICAgICAgICAgICMgKDQgdW5jaGFuZ2VkIGVsZW1lbnRzIGhpZGRlbiklMEEgICAgICAgIH0lMEEgICAgICAgICMgKDE1IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjcuMC8yNFwiXSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3Nfc3VibmV0XCIgXCJhbGxcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJzdWJuZXQtMDZmMzUyMTg1ZmZjM2ZjZDNcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgfiBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuNy4wLzI0XCIgLT4gXCJ3ZWJzaXRlOiBwcml2YXRlIDEwLjAuNy4wLzI0XCIlMEEgICAgICAgICAgICBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICAgIFwibWFuYWdlbWVudFwiICA9IFwiZmFsc2VcIiUwQSAgICAgICAgICAgIFwic2VydmljZVwiICAgICA9IFwid2Vic2l0ZVwiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC43LjAvMjRcIiAtPiBcIndlYnNpdGU6IHByaXZhdGUgMTAuMC43LjAvMjRcIiUwQSAgICAgICAgICAgICMgKDQgdW5jaGFuZ2VkIGVsZW1lbnRzIGhpZGRlbiklMEEgICAgICAgIH0lMEEgICAgICAgICMgKDE1IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3ZwYy52cGMgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX3ZwY1wiIFwidnBjXCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ2cGMtMGFlNzk4Zjk0MWJlNDUzNDVcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICB+IFwiTmFtZVwiICAgICAgICA9IFwiVlBDIDEwLjAuNC4wLzIyXCIgLT4gXCJWUEMgZm9yIHdlYnNpdGUgKHByb2R1Y3Rpb24pIDEwLjAuNC4wLzIyXCIlMEEgICAgICAgICAgICBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICAgIFwibWFuYWdlbWVudFwiICA9IFwiZmFsc2VcIiUwQSAgICAgICAgICAgIFwic2VydmljZVwiICAgICA9IFwid2Vic2l0ZVwiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIH4gXCJOYW1lXCIgICAgICAgID0gXCJWUEMgMTAuMC40LjAvMjJcIiAtPiBcIlZQQyBmb3Igd2Vic2l0ZSAocHJvZHVjdGlvbikgMTAuMC40LjAvMjJcIiUwQSAgICAgICAgICAgICMgKDQgdW5jaGFuZ2VkIGVsZW1lbnRzIGhpZGRlbiklMEEgICAgICAgIH0lMEEgICAgICAgICMgKDE0IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQVBsYW46IDcgdG8gYWRkLCA2IHRvIGNoYW5nZSwgOSB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiA3LCAiY2hhbmdlIjogNiwgImRlc3Ryb3kiOiA5fX0=```
</p></details>